[
    {
        "Sender Address": "noreply@you.co",
        "Sender Name": "YouTrip",
        "Subject": "Ready for a new adventure?",
        "Content": "ready for a new adventure?\nSpringtime is upon us! Beyond canals & cobblestone floors, catch Amsterdam in all its glory in spring during the tulip season. Plus, we've found some of the most majestic, yet climbable mountains around the world for you to tick off your bucket list this 2024!\n\n✧ here's to new experiences ✧\n\n \na guide to tulip season in Amsterdam 2024\nEverthing you need to know\n\nspringtime blooms like no other >\n \nmajestic mountains you need to see in this lifetime\nRanked by increasing difficulty \n\nlife's a climb, for a remarkable view >\n✧ deals highlights ✧\n \n \n \n \nTap the button below to redeem your deals on YouTrip Perks via the app now! Alternatively, you may enter your 10-digit Y-number on the YouTrip Perks website instead. \nredeem deals now\nVisit us at www.you.co to learn more.\n\n\nFollow us on Telegram, Facebook, and Instagram for our latest updates!\n \nyou.co\tinstagram\tfacebook\ttelegram\ttiktok\n \nCopyright © You Technologies Group (Singapore) Pte Ltd, 67 Ayer Rajah Crescent, 139950. All rights reserved.\n\nYou can update your preferences or unsubscribe from this list.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Sophie | Bright Network",
        "Sender Name": "team@news.brightnetwork.co.uk",
        "Subject": "Let's get physical…",
        "Content": "Careers & Wellbeing Week is here, Qingyang!\n\nIt's the week dedicated to helping you find balance in your career, physical health and mental wellbeing and, boy, do we have a fantastic week in store for you…\n\nTo get things started, you're invited to an exclusive event with PureGym tomorrow (Monday) at 1.30pm, where you'll:\n\nDiscover the science behind why physical activity and exercise is essential for your mental health\nGain practical top tips you can start using on the day to help you prioritise YOU\nTake part in a workout session put together specially for Wellbeing Week by one of PureGym's top personal trainers - and completely free!\n\nIf you're looking for a way to start your week off on a high, feeling energised both mentally and physically, this is the event for you.\n\nPlus, the event is taking place virtually, so you can join from the comfort of your own home.\n\nRegister your place now (spaces are limited) and we'll send you the link to join the live event.\n\nCan't wait to see you there!\n\nBest\nSophie",
        "Category": "Marketing"
    },
    {
        "Sender Address": "service@theeditorsmarket.com",
        "Sender Name": "The Editor's Market",
        "Subject": "NEW | Looks to spring into March",
        "Content": "These new arrivals have everything\ncovered. You just need to make\nenough plans to bring them out. \nExplore New Arrivals\n \nJosette Broderie Crop Top\n \nIt Would Be Opportune\nYou have our word with the easiest of our\nversatile silhouettes. One-shot it in a pleated\ntent dress — or leave it to the cropped separates\nto find their match among tailored bottoms for the\ngrind, and nylon shorts for the weekends. If you’re\nstill in a denim daze, our sell-out Valentia Top\nalso returns to impress once more. \nEllegra Curve-Hem Shorts\nAspen Square-Neck Knit Top, $29\nMalitta Linen Oversized Shirt, $49\nEllegra Curve-Hem Shorts, $39\nDemetris Relaxed Dress\nDemetris Relaxed Dress, $59\nDescue High-Rise Straight Skirt\nValentia Denim Pleated Tube Top, $45\nDescue High-Rise Straight Skirt, $49\nBelvar Button Down Top\nBelvar Button Down Top, $35\nEdelyn High-Rise Straight Pants, $45\nExplore New Arrivals\n \nFits by You\nMake them yours.\nTap to shop.\nTonya Straight Skirt, $49\nZulema Broderie Maxi Dress, $59\nErvie Mid-Rise Relaxed Sweatpants, $39\nEdelyn High-Rise Straight Pants, $45\n \nShare Your Style Story\nShare your look on Instagram\nand tag @theeditorsmarket for a\nchance to be featured alongside\nour community.\nFollow Us On Instagram\n \nTikTok\tThe Editor's Market Instagram\tThe Editor's Market Facebook\nCopyright © 2024 The Editor's Market Pte Ltd, All rights reserved.\nYou are receiving this email because you are our customer. \n\nThe Editor's Market Pte Ltd\n5 Jalan Kilang #05-01 The Mill\nSingapore 159405\nSingapore\n\nAdd us to your address book\n\n\nWant to change how you receive these emails?\nYou can update your preferences or unsubscribe from this list.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Talent.com",
        "Sender Name": "login@account.talent.com",
        "Subject": "Get Your Job Search Started!",
        "Content": "Welcome to Talent.com Get Ready to Amp Up Your Job Search!\n\nReady to take the next step? Let us do the work! Simply search for a job and we will send you personalized job postings every day. It only takes a few seconds to get started.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "WeBull",
        "Sender Name": "noreply@webull.com.sg",
        "Subject": "THE MORE YOU FUND, THE MORE YOU GET!",
        "Content": "Hi there,\n \nBoost the earnings from your funds with our exclusive offer! Get a 3% bonus in cash vouchers* when you deposit and maintain USD10,000 or more! \n \nLearn more\nThank you for choosing Webull. \n \nRegards, \nTeam Webull \n \n \n*T&Cs apply.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "TEN THOUSAND",
        "Sender Name": "support@tenthousand.cc",
        "Subject": "Your Gear Is Waiting",
        "Content": "Get 10% off Your First Purchase with code WELCOME10\nImage\n \nPRODUCT\nQTY\nTOTAL\n\n \nFoundation Short - Iron / No Liner\nColor: Iron\n \n 1\n   $56.00",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Pelago by Singapore Airlines",
        "Sender Name": "travel@pelago.co",
        "Subject": "Will you be seeing Ed Sheeran on 16th Feb?",
        "Content": "Hey Shenghan,\n \nThank you for your recommendation on what Ed Sheeran should do/visit/eat during his visit to Singapore!\n \nWe will be in touch with the winners today, keep your fingers crossed 🤞🏼🤞🏼\n \nIn the meantime, check out these experiences that came up top in the contest, with very creative suggestions that came with it.  ",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Poe",
        "Sender Name": "product-updates@poe.com",
        "Subject": "Now available on Poe: Claude 3",
        "Content": "Hi everyone,\n\nWe’re excited to announce the availability of Anthropic’s groundbreaking Claude 3 model family, including Opus, the most sophisticated model on the market!\n\nThe currently available Claude 3 family consists of two multimodal models - Opus and Sonnet:\nClaude 3 Opus: The most advanced and highest quality model on the market today. It can handle complex analysis, longer tasks with multiple steps, and higher-order math and coding tasks.\nClaude 3 Sonnet: This model strikes a balance between intelligence and speed.\nClaude 3 Haiku: Their fastest and most compact model, will be added on Poe as soon as it's made available.\nWe’ve also added two additional bots - Claude 3 Opus-200k and Claude 3 Sonnet-200k - which feature expanded context windows that allow you to input vast amounts of information with near-perfect recall, making them great for complex tasks and multi-step instructions. For context, 200k is roughly equivalent to around 150,000 words or a 500 page book.\n\nIn addition, all Claude 3 bots support adding images directly into conversations for richer interactions.\n\nLastly, we’re working on making Claude 3 available as a base bot for prompt and server bots. Stay tuned for an announcement when those are ready.\n\nWe appreciate your feedback and encourage you to continue sharing your thoughts at feedback@poe.com. You can stay updated on the latest updates and announcements by following us on Twitter and joining our Discord server.\n\nThanks,\nThe Poe Team\n\nOur goal is to offer you valuable product updates. You can unsubscribe if you’d like to stop receiving these updates.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "citibanksg@marketing.citibank.com.sg",
        "Sender Name": "Citibank Singapore",
        "Subject": "<ADV> Double the joy for less with 1-for-1 offers at Tim Ho Wan!",
        "Content": "Dig into bite-sized delights at Tim Ho Wan and double the pleasure with our 1-for-1 offers. Savour the hearty comfort from Pork Congee with Century & Salted Eggs, bite into the oozing goodness of Golden Lava Salted Egg Buns, and sample other scrumptious favourites from the menu. Plus, receive a S$5 return voucher for your next dim sum escapade.\n\nYou're always ahead when you dine with Citi Gourmet Pleasures.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Welcia - noreply",
        "Sender Name": "noreply@welcia-bhgsingapore.com.sg",
        "Subject": "Welcia-BHG Club 1st Anniversary:Thank you for being our Members for a Year",
        "Content": "Hi CELIA ! Let's celebrate your membership with the following reward from us.\nWelcia-BHG Club 1st Anniversary:Thank you for being our Members for a Year",
        "Category": "Marketing"
    },
    {
        "Sender Address": "mail@mail.adobe.com",
        "Sender Name": "Adobe Stock",
        "Subject": "Here’s your free template for Adobe Photoshop",
        "Content": "Send out a\nspringtime greeting.\nSend out a springtime greeting.\nBring dreamy vibes to your customers with this gradient postcard set from Wavebreak Media — free for Photoshop.\nGet free template\nFreshen up with Adobe Photoshop templates.\nFreshen up with Adobe Photoshop templates.\nGet a pastel refresh with these premium stock templates for Adobe Photoshop.\nSee Photoshop templates\nGet 10 free images, templates, or music tracks from Adobe Stock.\nGet 10 free",
        "Category": "Marketing"
    },
    {
        "Sender Address": "adidas",
        "Sender Name": "adidas@sg-news.adidas.com",
        "Subject": "Step into Eid with Style | Shop the Festive Collection Now! 😎\n",
        "Content": "Turn Up the Heat this Raya with Three Stripe Festive Fits 🔥\nShop the full festive collection online now and at selected adidas stores:\n📍adidas Brand Centre Orchard\n📍adidas Suntec City\n📍adidas Marina Bay Sands\n📍adidas VivoCity Performance (L1)\n📍adidas VivoCity Originals (B1)\n📍adidas Bugis +\n📍adidas ION Orchard\n📍adidas Bugis Junction\n📍adidas Causeway point\n📍adidas JEM\n📍adidas Jewel\n📍adidas OG People's Park\n📍adidas Waterway Point\n📍adidas Changi Terminal 2",
        "Category": "Marketing"
    },
    {
        "Sender Address": "hello@firstaidtraining.com.sg",
        "Sender Name": "SgFirstAid",
        "Subject": "Causes Of Nosebleeds In Children",
        "Content": "\nDear Long,\nWhat is it with children and nosebleeds?\nContrary to the lay belief that it is purely caused by “body heatiness”, there are actually 3 scientific reasons why nosebleeds occur in children. \n\nMore details on the causes of nosebleeds here  👉 WATCH NOW 👈\nSo now that we know the causes of nosebleeds, this gives us a good idea when working on the preventive measures 👍\n\nThank you for reading!\nYour partners in saving lives,\nSgFirstAid Team",
        "Category": "Marketing"
    },
    {
        "Sender Address": "jobalerts-noreply@linkedin.com",
        "Sender Name": "LinkedIn Job Alerts",
        "Subject": "“data analyst”: Tree Top Staffing LLC - Data Analyst and more",
        "Content": "LinkedIn        \nAbigail Lim\nYour job alert for data analyst\n2 new jobs in Singapore match your preferences.\nTree Top Staffing LLC        \nData Analyst\nTree Top Staffing LLC · APJ (Remote)\nEasy Apply        \nEasy Apply\n Bizbaz - Intelligent Finance        \nData Analyst (Remote)\nBizbaz - Intelligent Finance · APAC (Remote)\nSee all jobs\n Premium icon\nAbigail Lim\nSee jobs where you’re a top applicant\nTry Premium for free\nNever miss an update with the LinkedIn app\nDownload on the App Store  Get it on Google Play\nThis email was intended for Abigail Lim (Penultimate Business Analytics Undergraduate at NUS)\nLearn why we included this.\nYou are receiving Job Alert emails.\nManage job alerts    ·   Unsubscribe   ·   Help\nLinkedIn\n© 2024 LinkedIn Corporation, 1‌000 West Maude Avenue, Sunnyvale, CA 94085. LinkedIn and the LinkedIn logo are registered trademarks of LinkedIn.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "aapromotions@aas.com.sg",
        "Sender Name": "AA Singapore",
        "Subject": "Enjoy AA Membership Renewal discount when you participate in our cycling event!",
        "Content": "\nPARTICIPATE IN OUR CYCLING EVENT AND ENJOY \nAA MEMBERSHIP RENEWAL DISCOUNT! \n\nBe rewarded with a free 1-year Social Membership or opt for an Ordinary Membership at a discounted price of $50 (U.P. $82) only*. In addition, stand a chance to win Garmin watch worth $448 and other fabulous prizes. \n\nCycling with AA event is opened to everyone, AA Members and Public. \n\nRegistration is FREE!\n\n\n\n*Terms & Conditions apply",
        "Category": "Marketing"
    },
    {
        "Sender Address": "hello@members.mcdonalds.com.sg",
        "Sender Name": "MyMcDonald's",
        "Subject": "Hurry, Ji-An! Last Chance to redeem our 1-for-1 Deals!",
        "Content": "Hello Ji-An, \nIt’s the final week of our great deals! 🍔\nEnjoy 1-for-1 deals, 50% off deals and more!\nOnly on the McDonald’s app.\n \n Here are this week's deals!\n\n \nMon 1 – Tue, 2 April 2024\n50% off Chicken McNuggets®\n(6pc) Meal\n \n\n \nWed 3 – Thu, 4 April 2024\n50% off Double Filet-O-Fish®\nUpsized Meal\n \n \n \nThu, 4 April 2024\n1-for-1 Double Chocolate Frappé (S)\n \n\n \nFri, 5 April 2024\n1-for-1 Sweet Paprika Chicken\nMcCrispy® (2pc) Meal\n \nSat 6 – Sun, 7 April 2024\n$1 Potato Wedges* with any purchase\nClaim it in the McDonald's app \nCheck out the McDonald's App for many more deals!",
        "Category": "Marketing"
    },
    {
        "Sender Address": "MindFlex Home Tuition",
        "Sender Name": "admin@singaporetuitionteachers.com",
        "Subject": "New Tuition Assignments (1 April 2024)",
        "Content": "Dear Tutors, These are the available assignments for today (1 April 2024) filtered by the levels & subjects on your tutoring profile. To apply, do kindly click on the link below the assignment, or apply through: https://www.singaporetuitionteachers.com/adm/tutor/. For instant updates on available assignments, please also subscribe to our telegram channel at t.me/joinchat/AAAAAE3jzibukbBl4P1QmQ. If you require any technical support, please SMS/WhatsApp 8288 6556. We look forward to your applications! - MindFlex Home Tuition To Apply for Multiple Assignments at once, please access the assignment list via this link:",
        "Category": "Marketing"
    },
    {
        "Sender Address": "The Bone Marrow Donor Programme\n",
        "Sender Name": "reply@marketingbmdp.org",
        "Subject": "Joint Forces of a BMDP Donor and Survivor",
        "Content": "Hello Ryu Kairin Anaqi!\n \nJoint Forces of a BMDP Donor and Survivor\n \nIn 2017, Shen Hao was a university student who enrolled himself as a volunteer marrow donor during our roadshow at VivoCity - thinking that the chances of being a match would be slim. Two years later, the call from BMDP caught him by surprise!\n\nInitially raising suspicions of a scam, the familiar voice on the other end turned out to be his neighbour. This was a BMDP staff member who would be the one to guide and support him through his donation journey.\n \n\nAll smiles with Shen Hao and his neighbour as he donated via PBSC 😊\n\n\nFrom marrow donor to Ambassador\n \nIn January 2024, Shen Hao proudly embraced his role as a BMDP Ambassador, inviting us to his workplace for an educational talk where he shared with colleagues on his journey from signing up, to being found a match and finally undergoing the donation process.\n \n\n\nJoining us as well was fellow BMDP Ambassador Sapna, who was once diagnosed with Acute Myeloid Leukemia (AML) and it was critical. Due to the urgency to have a transplant, the doctors looked to her daughter for a haplo-identical transplant. Thankfully, it was successful and now, with a renewed purpose in life, she is dedicating herself to the cause of BMDP, urging others to join our registry. We were all also touched to hear her daughter declaring that she stands ready to donate if found to be a match to another patient.\n \n\nSurvivor Sapna joining forces with Shen Hao\n\nListening to the journeys of both a marrow donor and a survivor, many of the staff were inspired by the duo and proceeded to sign up. \n \n\n\nAs you wait for that magical call that you are a match to a patient, you have the power to help patients by inviting us to do a sharing and donor recruitment drive at your workplace or community. Just like Shen Hao had! Email us at dr@bmdp.org or drop us a message in our LinkedIn to harness your power of hope!",
        "Category": "Marketing"
    },
    {
        "Sender Address": "LifeSG@notify.gov.sg",
        "Sender Name": "LifeSG",
        "Subject": "Budget 2024: Find out the benefits you may be eligible for!",
        "Content": "Budget 2024: Use SupportGoWhere \nto easily see the benefits you may be eligible for!\n \nBudget 2024 will tackle immediate challenges for households and businesses, pursue better growth and jobs, equip our workers for life, create more paths for equality and mobility, provide more assurance for family and seniors, and forge a stronger and more united nation.\n \nVisit SupportGoWhere to find Budget 2024 schemes that you may be eligible for and calculate your estimated benefits.\nView Budget 2024 schemes\nView Benefits you may be eligible for with the Support For You Calculator\nSimply answer a few questions to view the schemes and benefits that may be relevant to you and calculate your estimated benefits. \n \nTry the Support For You Calculator now!\n \nBudget Booklet: Building Our Shared Future Together\nExplore this year’s Budget Booklet for a summary of the key Budget 2024 measures.\n \nRunning a business?\nVisit GoBusiness to find out the Budget 2024 schemes your business may be eligible for.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Medium Daily Digest",
        "Sender Name": "noreply@medium.com",
        "Subject": "How Algorithms Have Become \nEmbedded in Our Every Day Life \n| John Loewen, PhD in Data Storytelling Corner",
        "Content": "Data Storytelling Corner\nJohn Loewen, PhD in Data Storytelling Corner·6 min readMember-only content\nHow Algorithms Have Become Embedded in Our Every Day Life\nA story of algorithms — defined, simplified, applied, and critiqued Vu Trinh\nVu Trinh·19 min read\nHow does Uber build real-time infrastructure to handle petabytes of data every…\nAll insights from the paper: Real-time data infrastructure at Uber Starts With A Bang!\nEthan Siegel in Starts With A Bang!·11 min readMember-only content\nFlagship NASA space telescope faces a penny-pinching death\nNASA’s only flagship X-ray telescope ever, Chandra, still works and has no planned successor. So why does the… EduCreate\nEstacious(Charles White) in EduCreate·5 min readMember-only content\nThe 6th Graders in My School Laughed at the Lynching of Emmitt Till\nIt proves why we must tell these stories in our schools.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Girl Up",
        "Sender Name": "partnerships@girlup.org",
        "Subject": "Somebody's life might depend on it. – Emily, Girl Up USA",
        "Content": "Dear Qingyang,\n \n“Imagine if we could help all the girls in the world reach their true potential and eliminate the factors limiting women. I was always the ‘chubby kid’, so that created a really bad negative impact in my mind that I was ugly. I didn’t really see myself as attractive, growing into pre-adolescence. The mass media at large [had] a really negative impact on my body image and my self-esteem.”\n \nDo Emily’s words resonate with your daughter, sister, a friend, or perhaps, with you? Click here for Emily’s story (two-minute video) and learn how Girl Up improves and strengthens girls’ mental health and well-being.\nWhen examining youth substance use, experiences of violence, and suicidal thoughts and behaviors, female students are faring worse than males.[1] In 2021, 20% of girls in the U.S. reported experiencing sexual violence during the past year, 60% experienced persistent feelings of sadness or hopelessness, and 25% made a suicide plan.\n \nYet, despite these horrifying facts, Emily shares what we hear from Girl Up members every day: that mental health remains a stigmatized topic, and many youth suffer alone. “Professional help is really hard to find for teenagers and young adults. Through Girl Up, I really discovered a community that was close-knit. We had a shared common purpose, and very similar lived experiences.”  With your gift to Girl Up today, you’ll support immediate, meaningful connections all over the world. Your investment will ensure more girls have access to a diverse, supportive global community of peers in 2024 and beyond.\n \nEmily said it best: “Donating to Girl Up means donating to a better future. And we will all be there, in that future. So it's a really good investment to invest in girls, because we all want to live in a better world.”  Donate now for a better world - for girls and for us all.  Thank you,\nMelissa Kilby Chief Executive Officer, Girl Up",
        "Category": "Marketing"
    },
    {
        "Sender Address": "LeetCode",
        "Sender Name": "no-reply@leetcode.com",
        "Subject": "LeetCode Weekly Digest",
        "Content": "Hi LeetCoder!\nTest your growth! Whether you're a seasoned user or just starting, we are always here to celebrate you! Please check out this post to read about a user's achievement.\n\nDon't forget to join us for the March LeetCoding Challenge. You can earn LeetCoins daily, and even get a chance to win some at the end of the month, as well as a LeetCode polo shirt. Happy LeetCoding! 😎\nTop Picks For You\nQuestion\nConvert Sorted List to Binary Search Tree\nGiven the head of a singly linked list where elements are sorted in ascending order, convert it to a height-balanced...\n›\nPost\nFinally got my knight badge in 7 month intense practice\nThis is my second post. My very first discussion post is actually to seek for leetcode contest advice back in Oct. 2023. How time flies! ",
        "Category": "Marketing"
    },
    {
        "Sender Address": "shein@edm.shein.com",
        "Sender Name": "SHEIN",
        "Subject": "Hundreds of new arrivals that need 100% of your attention.",
        "Content": "\nYou get to see this before anyone else...\nSHEIN\nUnsubscribe | View in Browser\nWomen\nPlus\nMEN\nKIDS\nView more\nShop now\nReady For New?\n\nDAZY Women's Denim Sleeveless Dress With Front Buttons\nS$32.00\n\nDAZY Women's Denim Cami Dress\nS$39.00\n\nFRIFUL Women's Denim Shirt With Sailor Collar And Long Sleeves\nS$29.00\n\nSHEIN Essnce Street Style Casual Striped Elastic Waist Shorts\nS$11.00\n\nSHEIN VCAY Women's Shirred Denim A-Line Dress\nS$47.00\n\nSHEIN SHEIN WYWH Women's High Waisted 2 In 1 Ultra Shorts With Letter Printing, Casual Holiday Outfit\nS$11.00\n\nSHEIN Essnce Women's Silver Plating Adjustable Crop Top Camisole\nS$6.00\n\nSHEIN SHEIN Essnce Women's Casual High Waisted Stretchy Capri Leggings For Spring And Summer\nS$7.00\n\nLadies' Striped Drawstring Sleeveless Sweater Dress\nS$25.00\n\nSHEIN SHEIN BASICS Cotton High-Rise Drawstring Joggers\nS$9.00\n\nSHEIN Unity Zebra Striped Eyelash Lace Insert Draped Cami Dress\nS$12.60\n\nSHEIN SHEIN SXY Shell & Palm Tree Print Paperbag Waist Belted Pants\nS$13.80\n\nSHEIN SHEIN EZwear Mushroom Pattern Contrast Binding Crop Cami Top\nS$5.00\n\nSHEIN SHEIN SXY Plus Snakeskin Print Cut Out Crossover Front Flare Leg Jumpsuit\nS$15.00\n\nSHEIN SHEIN Slayr Plus O-ring Cut Out Tie Side One Shoulder Top & Slit Skirt\nS$23.00\n\nSHEIN Boys Allover Print Contrast Collar Polo Shirt\nS$7.00\n\nSHEIN SHEIN Modely Twist Front Cut Out Tee\nS$7.00\n\nSHEIN SHEIN SXY Ruched Ruffle Hem Schiffy Skirt\nS$12.60\n\n1 Pair of men's and women's cycling gloves Half finger gloves Punk gloves Street dance half finger gloves Leather fitness sports gloves Show gloves\nS$2.50\n\nSolid Satin Cami Formal Dress\nS$70.00\n\n1pc Bamboo Woven Round Dustpan, Small Snack Plate, Candy Snacks Melon Seeds Plate, Creative Household Round Plate, Mini Handmade Bamboo Tray Suitable For Home Outdoor;Rattan Tray Bamboo Sieve Tray Round Tray Home Art Wall Art Woven Bamboo Basket Tray Rustic Style Food Wooden Grouping Fruit Tray\nS$2.50\n\n2 Rolls Of 12-inch By 36-feet Perforated Bubble Wrap Total 72 Feet, Packing And Moving Bubble Roll\nS$10.75\n\nSHEIN Tween Boy Tropical Print Shirt Without Tee\nS$8.80\n\nAnti-perspirant Deodorant Roll-on Stain-free Sweat Odors, Long Lasting Fresh Scent For Men And Women\nS$1.75\n\nA Thoughtful Gift - Night Light, Suitable For Birthday, Anniversary, Valentine's Day And Father's Day, A Gift To Commemorate And Celebrate The Love With Your Husband\nS$6.25\n\n1PC Blackhead Remover Pimple Acne Removal Blackhead Vacuum Tool Skin Care Pore Cleaner Multifunctional Acne White Heads Removal Facial & Skin Care Devices\nS$6.53\n\nMini Karaoke Machine With 1 Or 2 Wireless Microphones For Kids Adults, Phone Portable Speaker , Portable Speaker Toy Gift For Girls 4, 5, 6, 7, 8+ Years Old, Teens Birthday, Gift It-Stylish Design And Beautiful Package Box Make It Perfect Birthday Christams Gift For , 9, 10, 11, 12+ Year Old Girls Boys Teens.With This Ultra-Portable Karaoke Machine, Everywhere Is The Stage. Cool Birthday Or Festival Gift For Your Kids, Friends Or Family.Portable Speaker With Microphone Set, Speaker With Home Karaoke Machine,Portable Handheld Karaoke Mics Speaker Machine ,Handheld Audio Wireless Microphone Children's Host Practice Sound Family Early Education K Song One Stereo\nS$23.40\nShop now\nShop now\nShop now\nShop now\nShop now\nView more\nView more\nView more\nFIND US ON\tAPP\nhttps://img.ltwebstatic.com/images3_sqs/2023/10/18/27/1697600510b6426fb75f642a132738bc5903cb4334.jpg  https://img.ltwebstatic.com/images3_sqs/2023/10/18/43/1697600520bf18c29e5bb90d4ca73f9a145a77819d.jpg  https://img.ltwebstatic.com/images3_sqs/2023/10/18/eb/169760053310421155a09a3adac5f920a42eca03f8.jpg  https://img.ltwebstatic.com/images3_sqs/2023/10/18/33/1697600541175d93398b0df4edb58d0231090e87ce.jpg  https://img.ltwebstatic.com/images3_sqs/2023/10/18/7e/1697600551baa27a1a54933f82bdb7d884896376f2.jpg\thttps://shein.ltwebstatic.com/advertise/shein/www/icon_SHEIN/sns-w-09.jpg  https://shein.ltwebstatic.com/advertise/shein/www/icon_SHEIN/sns-w-10.jpg\nYou received this message because you've registered or accepted our invitation\nto receive emails from SHEIN, or you've made a purchase from SHEIN.com.\nPlease Shop now: to stop receiving emails, click on the UNSUBSCRIBE button, and do not directly reply to this email, as this email was generated automatically and thus your unsubscription request will not be processed.\nPlease contact our customer service if you have any questions.\n12 Marina Boulevard, #15-01 Marina Bay Financial Centre Tower 3, Singapore 018982\nPRIVACY POLICY | CONDITIONS & TERMS",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Team Carousell",
        "Sender Name": "mediagroup@community.carousell.com",
        "Subject": "Carousell's Largest Car Giveaway 2024",
        "Content": "Hello Carouseller!\n\nIt’s your lucky day! In partnership with Prudential, OneShift by Carousell is giving away a pre-loved Volvo V40 T2 to 1 lucky winner.\n\nSimply fill up the form and stand a chance to walk away with a free car to drive inclusive of COE!\n\nWhat are you waiting for? Giveaway ends 1 April 2024.\n\nTerms and conditions apply. Winner will be selected and contacted via phone between 29 July to 2 August 2024.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "marketing@news.singsaver.com.sg",
        "Sender Name": "SingSaver",
        "Subject": "Get up to USD5K worth of Nvidia shares",
        "Content": "Get ready to ride the Al wave! Artificial Intelligence (AI) is exploding in popularity and set to dominate the global market over the next decade. Among the hottest Al stocks is Nvidia\n(NVDA), witnessing remarkable surges since early 2023. Thinking about diving into Nvidia and embracing the Al revolution? Well, here's your chance to jump in with Webull and\ngrab some thrilling rewards along the way!",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Carousell",
        "Sender Name": "carousell-8b0c-847a2e8-1ad419e54@mail.carousell.com",
        "Subject": "carousell_assistant sent you message(s) about Armaggeddon SMK-6C 104 Key RGB Mechanical Keyboard",
        "Content": "carousell_assistant: If it’s still available, renew your listing and we’ll position it higher up—for free!",
        "Category": "Marketing"
    },
    {
        "Sender Address": "myActiveSG",
        "Sender Name": "sport_crm@sport.gov.sg",
        "Subject": "[PROMO] Go for a ride🚴‍♀️ and slay it like a Spartan💪!",
        "Content": "OCBC Cycle 2024\n \nSave the date! Singapore’s largest cycling event returns on 11 & 12 May 2024 at the Singapore Sports Hub!\n\nOCBC Cycle 2024 returns with exciting ride categories for everyone! This year we have the new Foldie Ride presented by Brompton. For the young ones, there’s the Mighty Savers® Kids Ride where they can experience the joys of cycling with other young cyclists or their family members.\n \nEXCLUSIVE FOR ACTIVESG MEMBERS\nEnter promo code: ActiveCYCLE10\nto enjoy 10% discount off registration fees. Offer valid until 29 April 2024.\n \nSign up with your OCBC Card to enjoy additional 10% off. Or be the first 500 to sign up with OCBC Digital App and receive S$2 in cashback.\nREGISTER NOW",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Linkedin Job Alerts",
        "Sender Name": "jobalerts-noreply@linkedin.com",
        "Subject": "“software engineer” opportunities:",
        "Content": "Your Job Alert for software engineer \n30+ new jobs in Singapore match your preferences.\nPhillipCapital\t\nData Engineer\nPhillipCapital · Singapore (Hybrid)\n\nUOB\t\n20 company alumni\n\n \nEasy Apply\t\nEasy Apply\n\nLuxoft\t\nData Engineer(Junior)(Diploma only)\nLuxoft · Singapore (On-site)\n\nUOB\t\n34 company alumni\n\n \nEasy Apply\t\nEasy Apply\n\nLuxoft\t\nData Engineer - Singapore\nLuxoft · Singapore (On-site)\n\nUOB\t\n34 company alumni\n\n \nEasy Apply\t\nEasy Apply\n\nLuxoft\t\nData Engineer\nLuxoft · Singapore (On-site)\n\nNational University of Singapore\t\n11 school alumni\n\n \nEasy Apply\t\nEasy Apply\n\nHawksman Technology\t\nData Engineer\nHawksman Technology · Singapore (Hybrid)\n\n\t\nActively recruiting\n\n \nEasy Apply\t\nEasy Apply\n\nLuxoft Singapore\t\nJunior Data Engineer(Academy, Diploma Degree accepted) Singapore\nLuxoft Singapore · Singapore (On-site)\n\nNational University of Singapore\t\n1 school alum\n\n \nEasy Apply\t\nEasy Apply\n\nSee all jobs",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Novelship Crew",
        "Sender Name": "no-reply@send.novelship.com",
        "Subject": "Your liked Maison Château Rouge Jordan 1 Mid SE 'Fearless' CU2803-200 just changed in price",
        "Content": "THE ITEM YOU LIKE HAS CHANGED IN PRICE\nLowest List:\n\n571 SGD Hi, Chase\nGreat news! The Maison Château Rouge Jordan 1 Mid SE 'Fearless' CU2803-200 in your wishlist has a new list price.\nBUY NOW before anyone else does! MAISON CHÂTEAU ROUGE JORDAN 1 MID SE 'FEARLESS' CU2803-200\nSize: US 10 | Condition: Brand New, 100% Authentic Highest Offer: 63 SGD | Lowest List: 571 SGD\nReach out at Support Request or support@novelship.com for any assistance.\n\nGood Luck,\nNovelship Crew\n",
        "Category": "Marketing"
    },
    {
        "Sender Address": "YouTrip",
        "Sender Name": "noreply@you.co",
        "Subject": "Lock in the best JPY rates now! 🇯🇵\n",
        "Content": "PSA: the JPY hit 112.85 yen against the SGD on 21 Mar 2024!\n The current rate at the time of writing on 22 Mar 2024 stands at S$1 to 112.32 yen! If you're heading to Japan soon, lock in the best JPY rates NOW in your YouTrip wallet! \n\nCheck out our step-by-step guide on using the new QR Code for immigration clearance at Singapore checkpoints! Plus, we've got a 2-day KL itinerary AND a 7-day Taiwan guide all lined up for you. \n\nBONUS: We're giving away two pairs of Singapore Airlines flight tickets & prizes worth S$9,000! Find out how you can be one of our lucky winners.\n\n✧ start planning your next getaway ✧\n\n\n[TIKTOK GIVEAWAY] \nWin a pair of Singapore Airlines flight tickets to ANYWHERE or attractive prizes worth S$9,000!\n\nget creative & good luck! >\n\na guide to QR code immigration clearance at Singapore land checkpoints \nHere's a step-by-step guide on how to use the new QR Code immigration clearance at land checkpoints!\n\nhooray to faster immigration clearances >\n\n48 hours in Kuala Lumpur: best things to do in 2 days\nIn need of a short getaway? We've got the next 48 hours planned out for you\n\nfor a quick weekend getaway >\n\nthe ultimate 7-day Taiwan itinerary 2024\nExplore Taipei's night markets, marvel at Alishan & more with this 7-day itinerary!\n\nTaiwan BBT, here we come! >",
        "Category": "Marketing"
    },
    {
        "Sender Address": "marketing@news.singsaver.com.sg",
        "Sender Name": "SingSaver",
        "Subject": "🚘 Know the cheapest CBD parking hotspots",
        "Content": "Park For Less Or Free!\nWhile owning a car in Singapore may drain your piggy bank, we've got the inside scoop to keep your parking woes at bay! From Marina Square to Orchard, Raffles City or Sentosa, wherever your adventures take you, here’s a list of the most budget-friendly, and yes, even free parking spots in downtown to rev up your savings! 🌟\n \nCheapest Parking Near Marina Square\nWe've found the cheapest parking options nearby to help you save money while shopping and dining in the area. \nRead Time: 5 Mins\nPark Worry Free >>\nImage\n \nPocket-Friendly Parking Spots Near Marina Bay Sands\nDiscover the cheapest and most convenient places to park while enjoying everything this iconic destination offers.\nRead Time: 7 Mins\nFind Out Now >>\nImage\n \nProtect Your Car, Unlock Exclusive Deals\nStand a chance to win S$5200 worth of petrol voucher PLUS get a Valore Cordless Car Vacuum worth S$79.90! Get up to 23% off or S$300 cashback for select car insurance! T&Cs apply. \nSponsored Promotion\nBuy now >>\nImage\n \nWhere To Park Near Raffles City\nLooking to save money on parking for your next visit to Raffles City? This article will uncover the most budget-friendly options available to you. \nRead Time: 6 Mins\nPark For Less >>\nImage\n \nSentosa Island: Entrance Fee And Parking Rates\nDriving into Sentosa for a family day out? Here’s everything you need to know about the island's entrance fees cost, car park rates and hacks on how to save.\nRead Time: 7 Mins\nTell Me More >>\nImage\n \nUltimate Guide To Parking In Orchard and Dhoby Ghaut\nUncover some of our best-kept secret parking spots in Orchard where you can park your car for cheap (and even free) at all hours of the week.\nRead Time: 10 mins\nEnjoy Free Parking >>\nImage\n \nOur Biggest-Ever UOB Cards Offer Is Here\nBe the first 200 to apply for select UOB cards and snag a Dyson hair styler or vouchers, on top of ongoing card offers! \n \nOther applicants will score S$60 worth of vouchers — there’s something for everyone!",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Spotify",
        "Sender Name": "no-reply@spotify.com",
        "Subject": "Playlists made just for you.",
        "Content": "Playlists as unique as you.\n\t\nNo one has playlists like yours.\n\nDiscover the music you love and music we think you’d love with these personalized playlists. Discover Weekly:\na weekly mixtape of new finds and deep cuts.\n\nListen Now >\t\nDaily Mix:\npersonalized playlists updated daily that feature your favorites.\n\n< Listen Now\n\n\t\nOn Repeat:\nsongs you keep returning to.\n\t\nRelease Radar:\nhear new releases from the artists you love.\n\n< Listen Now\n\n\nListen Now >\n\n",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Gurobi Optimization",
        "Sender Name": "marketing-ops@gurobi.com",
        "Subject": "Webinar Reminder: Where Data Meets Decisions on Feb. 27",
        "Content": "Hi Chase, We invite you to join us for the Where Data Meets Decisions - Part 3 webinar on February 27 at 11 AM ET. Data science is used to help improve decision-making and applies to nearly all industries, academic research, and curricula that require enhanced decision-making with complexity. This webinar will explore how mathematical optimization is an invaluable tool to improve decision-making and how it works seamlessly with machine learning to help problem solvers get the most out of their well-tuned predictive models. Hosted by Jerry Yurchisin, Data Science Strategist at Gurobi, this webinar will deliver: A brief introduction to mathematical optimization and its use cases. A new Python Notebook modeling example that takes you from data to optimal decisions. An example from Gurobi's set of ready-to-solve models, where you can use optimization with no prior experience. We'll then cover all the learning material Gurobi has made freely available for anyone to use. Don't miss out – let's dive into data-driven decision-making together. Register Now We hope you will join us for this informative presentation! Did you miss parts 1 and 2? Not a problem! You can find the recordings for both sessions below. This session covers all new material. Viewing the previous sessions in this series is recommended but not required to join. Where Data Meets Decisions - Part 1 Where Data Meets Decisions - Part 2",
        "Category": "Marketing"
    },
    {
        "Sender Address": "foodpanda",
        "Sender Name": "contact@info.foodpanda.sg",
        "Subject": "😅 Phew, almost forgot about your $6 discount!",
        "Content": "Use it now before it's gone!\nHey Ryu,\n\nYou can still use your $6* discount.\nIt's waiting for you in 'Vouchers' on your app.\n\nPick what you need and we'll be there in a tap.\n\nCheers,\nYour foodpanda team\n \norder now\n \n*Valid up to $6 for orders $20 or more, until 12/01/2024.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "BookMyShow",
        "Sender Name": "newsletter.bmsmy@bookmyshow.com",
        "Subject": "HK Boyband MIRROR's debut concert in Malaysia !",
        "Content": "BookMyShow\nHong Kong's Hottest Cantopop boy band, MIRROR, consisting of 12 members: Alton Wong, Anson Kong, Anson Lo, Edan Lui, Frankie Chan, Ian Chan, Jer Lau, Jeremy Lee, Keung To, Lokman Yeung, Stanley Yau and Tiger Yau is finally here with their debut concert in Kuala Lumpur, Malaysia as part of its \"MIRROR FEEL THE PASSION CONCERT TOUR 2024 • ASIA\" on the 28 April (Sun), 7PM at the Axiata Arena, Bukit Jalil, Kuala Lumpur.\nMIRROR, made their debut in November 2018 with the release of their first single, \"In a Second,\" (一秒间) after debuting on ViuTV's reality talent competition, [Good Night Show - King Maker]. Their first live concert, \"2018 THE FIRST MIRROR LIVE CONCERT,\" took place in Hong Kong in December 2018, not long after their debut launch. Incredible ticket sales marked a historical moment in the Hong Kong entertainment industry.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Duolingo",
        "Sender Name": "hello@duolingo.com",
        "Subject": "You made Duo sad 😢\n",
        "Content": "...but then he kept learning German without you.\n \n\n \t\n \n30 days later, Duo has learned as much as half a semester’s worth of university-level German class*. He also started making his own sourdough, but that’s probably unrelated.\n\n \nThere’s still time to catch up! Take a 5 minute lesson now.\n\n \n  GET BACK ON TRACK  ",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Spotify",
        "Sender Name": "no-reply@spotify.com",
        "Subject": "The songs that define your favorite artists.",
        "Content": "Songs from the artists you love—in one playlist.\n##\nThese are the songs that turn artists into legends.\nplaylist 1\nplaylist 2\nFrom the big hits to the fan favorites—here are songs you know and love by your top two artists.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Singapore Sports Hub",
        "Sender Name": "no-reply@sportshub.com.sg",
        "Subject": "Tickets Out Now: Singapore vs. China World Cup Qualifiers Round 2 at National Stadium",
        "Content": "FIFA WORLD CUP 2026™ - PRELIMINARY (ROUND 2) - SINGAPORE VS CHINA\n21 March 2024, 8:30PM\nNational Stadium\n\nTicket Promo Period: 26 Feb (Mon), 12AM to 3 Mar (Sun), 11:59PM\nGeneral Sale: 4 Mar (Mon), 12AM onwards\n\nThe Lions return to the National Stadium to face China on 21st March 2024. Be part of the action as the Lions are led out by new Head Coach Tsutomu Ogura for the time. Secure your tickets now!\n\nExclusively for Singapore Sports Hub's subscribers:\nSimply click on the link below to purchase or enter the password SSHM to enjoy the promo rates to the event! Promotion valid till 3 Mar (Sun), 11:59PM\n\nMORE INFO | BUY TICKETS",
        "Category": "Marketing"
    },
    {
        "Sender Address": "info@emails.hoka.com",
        "Sender Name": "Hoka",
        "Subject": "Color duo: white and blue",
        "Content": "COOLER COLORS​\n \nLight and bright for spring. Refreshed white-and-blue styles are here. ​\n \nSHOP NEW COLORS​\n \n \n \n \t\n \n \t\nJUST DROPPED​\n \n \n \t\n \n \t\nMEN'S CLIFTON 9\n \t\nWOMEN'S ARAHI 7\n \nMEN'S CLIFTON 9\n \t\n \nWOMEN'S ARAHI 7\n \n \n \n \t\n \n \t\nMEN'S BONDI 8\n \t\nWOMEN'S GAVIOTA 5\n \nMEN'S BONDI 8\n \t\n \nWOMEN'S GAVIOTA 5\n \n \n \n \t\n \n \n \t\n\n \n \t\n \n \t\nNEW APPAREL DROP\n \nLightweight, soft, breathable. Just right for running on a warm day.​\n \nSHOP THE LATEST\n \n \n \n \t\n \t\n \n Hoka Membership\n \nNot a member yet? Sign up and get:\n \n \n \nFree Shipping\n \n \nFree Extended\n60 Day Returns\n \n \nExclusive\nAccess to Events\n \n \nJoin Us\n \n \n \n \t\n \t\n \n \n \n \n \n \t\n \n\n \nGet Text\nOffers\n \nSign up and get Free Expedited\nShipping on your next order.\n \nSign Up >\n\n \nLocate a\nStore\n \nFind a HOKA pop up store or\nretail partner near you\n \nFind a Store >\n \n \n \t\n \t\n \nSocial: Facebook\tSocial: Instagram\tSocial: Twitter\tSocial: YouTube\tSocial: Strava\nContact Us\n \n \n \n \t\n \t\n \n*Free returns applies to orders shipped within the continental United States and placed on hoka.com. To print your returns label please visit hoka.com/returns.\n\nFree Expedited Shipping on your first full-price order is available when you sign up for HOKA text messages. New text subscribers only. Is only available on orders shipped within the Continental United States. Not retroactive on previous purchases and offer cannot be combined with other promotions. While supplies last. \n\nWe only send emails to individuals who have registered at our site: hoka.com\n \n \n \n \t\n \t\n \n1.866.491.3125\n250 Coromar Drive, Goleta, CA 93117\nPrivacy Policy   |   Unsubscribe",
        "Category": "Marketing"
    },
    {
        "Sender Address": "dailynews@edm.straitstimes.com",
        "Sender Name": "\nST Full-time Report",
        "Subject": "We want Lions to do us proud: FAS president | Ritual Gym had no choice but to shut down, says CEO",
        "Content": "Dear ST reader,\n\nFootball Association of Singapore president Bernard Tan and new Lions coach Tsutomu Ogura shared their hopes for the national team in a podcast with my colleague Deepanraj Ganesan.\n\nNext, Ritual Gym co-founder and chief executive Brad Robinson blamed the Covid-19 pandemic for its business woes. It has ceased operations at all four locations here and has “placed the company in provisional liquidation”.\n\nFinally, Singapore sprinter Marc Louis broke another longstanding national record, the 60m, thanks to his fine effort at the World Athletics Indoor Championships in Glasgow on March 1.\n\nSee you again next week. For the latest news on Singapore sports, check out ST Sport.\n\nFAS president Bernard Tan: All we ask for is a S’pore team that makes us proud\n\n\nHe and new Lions coach Tsutomu Ogura are guests on The Straits Times’ podcast series Hard Tackle.\n\nAsean championship’s schedule clash with Asian club competitions will hurt Lions\n\n\nClubs are not obligated to release their players for the Nov 23-Dec 21 Asean tournament, as it is held outside the Fifa international window.\n\nWe were burning money, says Ritual Gym co-founder after sudden closure of Singapore branches\n\n\nCEO Brad Robinson blames the pandemic for its business woes as a key investor pulled out of a deal.\n\nS’pore sprinter Marc Louis claims another longstanding record with 60m blitz at world indoors\n\n\nOn his first 60m indoor attempt on March 1, he broke the national record with a 6.69-second effort in the first round.\n\nIn The Driver’s Seat: Despite Horner drama, Red Bull may have the last laugh after dominant F1 start\n\n\nThey left Bahrain headed for Jeddah still the team to beat, despite all their troubles, writes David Tremayne.\n\nSilat exponents focused on training amid probe involving federation’s chief Sheik Alau’ddin\n\n\nThe two-time world champion and four-time Coach of the Year was arrested last November for suspected criminal breach of trust.\n\nSwimmer Quah Ting Wen hoping for dream Paris Olympics outing with siblings\n\n\nShe is part of the women’s 4x100m medley relay team that have qualified for the Summer Games.\n\nSporting Life: If you’re a weekend warrior, tips can make sport more fun\n\n\nGet tips from experts in Play of the Month, a new series The Straits Times sports desk launched in January.\n\nLocal golfers take all three qualifying slots for S’pore Classic\n\n\nProfessionals Nicklaus Chiam and Joshua Yap and amateur Irvyn Tan will compete at the US$2.5 million tournament.\n\nIf you received this newsletter from someone, sign up here to get weekly updates right in your inbox.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "noreply@tradingview.com",
        "Sender Name": "TradingView",
        "Subject": "Time is running out",
        "Content": "Lunar New Year Sale\n \n\nENDS SOON\n \n\n \nGet up to\n65% OFF\n \n\n \nYou wouldn’t want to miss out on this offer. As our Lunar New Year Sale is coming to a close, this is the perfect time to get your favorite charts with up to 65% off. There’s still time - the deal ends by the end of February 11nd. \n\nHop on the sale before it is over.\n ",
        "Category": "Marketing"
    },
    {
        "Sender Address": "noreply@email.greyhound.com",
        "Sender Name": "Greyhound",
        "Subject": "Celebrate Read a Roadmap Day by planning your next adventure",
        "Content": "Explore New Destinations on Read a Road Map Day\nDid you know that Read a Road Map Day is on April 5th? Whether you prefer the nostalgia of a paper map or the convenience of a digital app, it's the perfect time to book an adventure and explore the world around you.\nBook Now\n \nAdventure Awaits: Where Will You Explore First?\nAtlanta\nBaltimore\nCharlotte\nAtlanta\nBaltimore\nCharlotte\nColumbus\nMiami\nVirginia Beach\nColumbus\nMiami\nVirginia Beach\n\nPay with PayPal\nNow you can pay with PayPal when you check out on Greyhound.com. And you may be eligible for PayPal Pay Later, splitting the cost over several months.\nBook Now\n \n\nWindow or Aisle?\nSelect your preferred seat when booking your ticket! A small fee applies when you make the selection. Now, all customers will have a seat assignment and must sit in that assigned seat on board.\nChoose My Seat\n\nManage My Booking\nWant to head our earlier on your next trip? Check to see what’s available and make the change online.\nManage My Booking\n \nFree Onboard Entertainment\nSome of the movies & TV shows playing now\nThe Big Bang Theory        The Equalizer        Aquaman\n",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Glassdoor",
        "Sender Name": "noreply@glassdoor.com",
        "Subject": "Just in at Inland Revenue Authority of Singapore: This week's employee reviews and more",
        "Content": "New content from Inland Revenue Authority of Singapore\nInland Revenue Authority of Singapore\tInland Revenue Authority of Singapore\n2 New Glassdoor Reviews\nMarch 27\n\"Friendly colleagues, good working environment\"\nFormer Employee - Individual Income Tax Enquiries Agent in Singapore\nPros - good location, good office culture\nCons - Not really, worked it as a temporary job only\nRead more\nMarch 27\n\"Temporary Tax officer\"\nFormer Employee - Tax Associate\nRecommends\t\nNeutral Outlook\nNo Opinion of CEO\t\t\nPros - Work environment is very supportive and positive. I absolutely loved my supervisors and my coworkers...\nCons - Eyes very dry after a whole day of typing at the computer. Work gets mundane after awhile.\nRead more",
        "Category": "Marketing"
    },
    {
        "Sender Address": "no-reply@spotify.com",
        "Sender Name": "Spotify",
        "Subject": "Jump into the depths of Pop music.",
        "Content": "We hear you \nlike Pop.\nBurst\nYou spend a lot of time listening. We spend a lot of time making playlists to listen to.\n Top Throwbacks 2023\n It's a Hit!\nDiscover the new and familiar artists who make the genre what it is.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Weights & Biases AI Academy",
        "Sender Name": "academy@mail.wandb.ai",
        "Subject": "Enterprise Model Management course with Hamel Husain is out now!",
        "Content": "Hi Shenghan!\n\nAt W&B, we understand the challenges of managing machine learning models at scale, involving version control, governance, and team collaboration. That's why we're introducing our Enterprise Model Management course, led by Hamel Husain, founder at Parlance Labs and previously ML Engineer at Github, AirBnB and Datarobot.\n\nEMM course.png\nThis free course will guide you through effective model management strategies, what webhooks are & how to use them to create tool integrations, how to automate your training and evaluation workflows, sharing best practice design patterns and lots more!\n\nRegister today!\nLearn from the best practices that define leading ML teams.\n\nDarek Kłeczek,\nDirector of Weights & Biases AI Academy",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Duke University",
        "Sender Name": "no-reply@m.mail.coursera.or",
        "Subject": "Would a course on climate change help your career?",
        "Content": "We want your ideas for education on climate change and sustainability\n\nDuke University is seeking your feedback on how we can develop learning opportunities that provide you with the skills and actionable knowledge you need to engage with and solve problems related to climate change, sustainability, and the environment.\n\nIf you are interested in continuing your education in these areas, whether through a degree or non-degree program, certificate, or workshop, our team would welcome your input and ideas in this survey. If you have any questions about the survey, please reach out to us at climate-commitment@duke.edu.\n\nTake the survey\n\nAt the end of this survey, there is the opportunity to enter for a chance to win a $20 Amazon gift card. Thank you in advance for your ideas about how Duke can design and deliver learning that benefits your growth and career!",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Revolut",
        "Sender Name": "no-reply@revolut.com",
        "Subject": "Plan your spring travels with Revolut",
        "Content": "Handy features springing up in-app\nCheck out our travel-friendly features, from limit orders on exchanging currencies to budgeting\nHi Wei Cheng,\n\nMake your travel plans bloom this March. Whether you're eager for the upcoming Sakura season in Japan, or Songkran in Thailand, we've got what you need to plan the perfect trip. Rates and features worth bragging about\nWith limit and stop orders, your trip is about to get easier. You can set a limit, and we'll automatically exchange currencies for you, when the exchange rate reaches your pre-defined limit. We also have over 30+ currency pockets available for you to exchange in advance.\nEnd the overspend\nCheck out our budgeting feature by following the steps below:\n\n1. Tap the button below on your mobile to open the app\n\n2. Tap on the bar graph icon on the top right (next to the cards icon)\n\n3. Keep track of your spending by category and create customised budgets\nWherever spring takes you, you'll be prepared with our features in-app, springing left, right, and centre.\n\n— Team Revolut",
        "Category": "Marketing"
    },
    {
        "Sender Address": "hello@news.railway.app",
        "Sender Name": "Railway",
        "Subject": "Features Page, Template Composer GA, Cron Improvements",
        "Content": "Changelog Time!\n\nIt's Friday and you know what that means! Here's a summary of the stuff we shipped this week:\n\nFeatures Page\nTemplate Composer GA\nCron Improvements\nFixes and Improvements\nRead the changelog\nYou can reply to this email with thoughts/feedback on the changes we're making or even better, join us on our Discord!\n\nRegards, \nYour friends at Railway",
        "Category": "Marketing"
    },
    {
        "Sender Address": "Trip.com@newsletter.trip.com",
        "Sender Name": "Trip.com",
        "Subject": "Staycation Specials: Resorts World Sentosa!",
        "Content": "Amp Up Your Staycation With Resorts World Sentosa!\nExperience the best of a local getaway with Resort World Sentosa and enjoy exclusive rates from now till 4 Feb. Grab these limited-time offers while stocks last!\nGrab limited S$50 OFF Coupon!\nGet additional S$50 OFF (min. spend S$250) on your hotel bookings *selected hotels only\n🏨 Selected RWS Hotels\nCLAIM NOW!\nS$50 OFF min. spend S$250\nView Deals Now\n⭐ Resorts World Senstosa Specials ⭐\nEnjoy exclusive rates up to 15% OFF\nGenting Hotel Jurong Singapore\nGenting Hotel Jurong Singapore \n4.3 /5\nVery Good\n Singapore\n\nGreat service\nFree Cancellation\nS$ 228\nCheck Availability\nResorts World Sentosa - Hotel Ora\nResorts World Sentosa - Hotel Ora  \n4.3 /5\nVery Good\n Singapore\n\nGreat rooms\nThis price includes meal(s)\nS$ 489\nCheck Availability\nResorts World Sentosa - Equarius Villas\nResorts World Sentosa - Equarius Villas \n4.8 /5\nAmazing\n Singapore\n\nGreat stay!\nS$ 1,233\nCheck Availability\nResorts World Sentosa - Equarius Hotel\nResorts World Sentosa - Equarius Hotel  \n4.5 /5\nGreat\n Singapore\n\nGreat rooms\nThis price includes meal(s)\nS$ 549\nCheck Availability\nResorts World Sentosa-Hotel Michael Singapore\nResorts World Sentosa-Hotel Michael Singapore \n4.5 /5\nGreat\n Singapore\n\nHas play area for children\nFree Cancellation\nS$ 441\nCheck Availability\nResorts World Sentosa - Crockfords Tower Singapore\nResorts World Sentosa - Crockfords Tower Singapore \n4.7 /5\nAmazing\n Singapore\n\nFree Cancellation\nS$ 1,029\nCheck Availability\nResorts World Sentosa - Hard Rock Hotel\nResorts World Sentosa - Hard Rock Hotel \n4.1 /5\nVery Good\n Singapore\n\nGreat for kids\nThis price includes meal(s)\nS$ 489\nCheck Availability\nBook Now\n📢 More Deals For You 📢\n\n\n\nAbout Trip.com\nTrip.com is a leading international online one-stop travel service provider, available in 21 languages across 31 countries and regions. Our platform combines over 1.4 million hotels in 200 countries and regions, 2 million flights connecting more than 5,000 cities, and world-class 24/7 English language customer service as well as additional centres in Edinburgh, Tokyo and Seoul, ‘Creating the best travel experience’ for our millions of customers worldwide.\n\nGet our award-winning app to unlock cheaper prices!\n\t\t\nAccess deals too cheap to publish on our website\n\t\t\nEarn bonus Trip Coins on every booking\n\t\t\nPlan and book your next trip wherever you are\nDownload Now\n\nAbout Us|Privacy Statement|Terms & Conditions\nAdvertised prices, your member tier, Trip Coin amounts, and Trip Coin exchange rates are correct at time of publication and are subject to change without notice. All times listed in this email are GMT+8 unless otherwise noted. Sign in to book \"Email Exclusive\" prices. If you’d prefer not to receive this type of promotional emails from Trip.com, you can adjust notification preferences or unsubscribe. This is an automatically generated email. Please do not respond to this message.\nCopyright © 1999-2024 Trip.com. All rights reserved",
        "Category": "Marketing"
    },
    {
        "Sender Address": "LeetCode",
        "Sender Name": "no-reply@leetcode.com",
        "Subject": "LeetCode Weekly Digest",
        "Content": "Hi LeetCoder!\nUnlock New Heights! Your dedication will not go unnoticed. We can't wait to witness the amazing badges you'll earn and the milestones you'll reach throughout the year. Please check out this post to read about a user's recent achievement.\n\nDon't forget to join us for the February LeetCoding Challenge. You can earn LeetCoins daily, and even get a chance to win some at the end of the month, as well as a LeetCode polo shirt. Happy LeetCoding! 😎\nTop Picks For You\nQuestion\nUnique Paths III\nYou are given an m x n integer array grid where grid[i][j] could be: 1 representing the starting square. There is...\n›\nPost\n50 days badge 2024 !!!\nExciting News! Celebrating 50 Days on LeetCode: A Journey of Growth 🚀 Dear LeetCode Community ! I'm thrilled to announce that I've just received my 50 days ",
        "Category": "Marketing"
    },
    {
        "Sender Address": "support@keychron.com",
        "Sender Name": "Keychron | Mechanical Keyboards for Mac, Windows and Android",
        "Subject": "🎉 Keychron 7th Anniversary Deals | Seize Spectacular Savings!",
        "Content": "Celebrate Keychron's 7th Anniversary! Thank you for choosing Keychron. In appreciation of your continued trust and support, we're offering Anniversary Deals: Enjoy 20% off keyboards, mice, switches, keycaps, and more! (Excludes Q Max, K Max, V Max, and certain items.)\nDeals are available thru 11:59 p.m. April 9th (ET). Grab this opportunity for fantastic savings！👇",
        "Category": "Marketing"
    },
    {
        "Sender Address": "[SNKRDUNK]",
        "Sender Name": "no-reply@snkrdunk.com",
        "Subject": "The #SNKRDUNKme campaign has been extended!",
        "Content": "📸 The #SNKRDUNKme Campaign Is Extended Till 3 March (SGT)! ​Keep the posts coming! Wear your favorite SNKRDUNK cop and post a photo on your Instagram feed with #SNKRDUNKme. Selected posts will be shared on our social media accounts and/or on a collage flyer that comes with every purchase from our global app. A total of 5 Instagram users from the selection will win US$100 in SNKRDUNK coupons each! HOW TO JOIN WE THINK YOU'LL LOVE... Travis Scott × Nike Air Jordan 1 Low Golf NRG \"Neutral Olive\"",
        "Category": "Marketing"
    },
    {
        "Sender Address": "noreply@glassdoor.com",
        "Sender Name": "Glassdoor Jobs",
        "Subject": "Singapore Credit Trader at Hemmersbach and 14 more jobs in Singapore for you. Apply Now.",
        "Content": "Your daily job listings for 2 April 2024\nTrader Intern\n\tSingapore\nSinochem International Oil (SG)\tSinochem International Oil (SG)\t\nTrader Assistant\nSingapore\n$6K - $7K (Employer est.)\nVIpa Singapore PTE LTD\tVIpa Singapore PTE LTD\t\nTrader\nOld Kallang Airport Estate\n$3K - $5K (Employer est.)\n\tEasy Apply\nQube (Armenia)\tQube (Armenia)\t\nQuantitative Trader\nSingapore\n$11K - $23K (Employer est.)\nCGS International Securities\tCGS International Securities\t\n3.6 ★\nSales Trader\nSingapore\n$3K - $8K (Employer est.)\nCaliber8\tCaliber8\t\n3.5 ★\nBunker Trader (European MNC)\nSingapore\n$6K - $10K (Employer est.)\nYTSH SINGAPORE PTE. LTD.\tYTSH SINGAPORE PTE. LTD.\t\nBase Metal Trader\nSingapore\n$5K - $13K (Employer est.)\nGRASSHOPPER ASSET MANAGEMENT PTE. LTD.\tGRASSHOPPER ASSET MANAGEMENT PTE. LTD.\t\nQuant Trader\nSingapore\n$8K - $15K (Employer est.)\nHemmersbach\tHemmersbach\t\n3.4 ★\nEquity Derivatives Trading Analyst H/F\nSingapore\n$83K - $96K (Glassdoor est.)\nRecruit Expert\tRecruit Expert\t\n4.0 ★\nTechnical Coordinator (Oil Trading, up to $3,200)\nSingapore\n$3K - $3K (Employer est.)\nCoreTRM\tCoreTRM\t\nSupport Analyst (Oil/Energy Trading & Risk Management)\nSingapore\n$4K - $5K (Employer est.)\n\tEasy Apply\nRecruitPedia\tRecruitPedia\t\n3.8 ★\nLNG Trader (Oil & Gas MNC)\nSingapore\n$15K - $25K (Employer est.)\nGFI\tGFI\t\nExecution Trader\nSingapore\n$13K - $20K (Employer est.)\nDBS Bank\tDBS Bank\t\n4.0 ★\nSVP, Trader & Structurer, FX/Commodities/Emissions Derivatives, Treasury & Markets (ID: WD60147)\nSingapore\n$15K - $27K (Employer est.)\nHemmersbach\tHemmersbach\t\n3.4 ★\nSingapore Credit Trader\nSingapore\n$26K - $33K (Employer est.)\nARTEMIS\tARTEMIS\t\n4.6 ★\nTrading Risk Analyst - Crypto, DEX\nSingapore\n$8K - $14K (Employer est.)\nENGIE\tENGIE\t\n3.9 ★\nTrading Surveillance Analyst\nSingapore\nOnyx SG\tOnyx SG\t\nSenior Trader (Ferrous Metals)\nSingapore\n$15K - $25K (Employer est.)\nReeracoen Group\tReeracoen Group\t\n4.0 ★\nExecutive (Metal Trader)\nSingapore\n$4K - $5K (Employer est.)\nDBS Bank\tDBS Bank\t\n4.0 ★\nAVP, eFX Trader (Night), Global Financial Markets (ID: WD61406)\nSingapore\n$7K - $12K (Employer est.)\nGood Job Creations\tGood Job Creations\t\n4.2 ★\nSettlements Executive [Energy Trading Industry// Up to $6,500]\nSingapore\n$4K - $7K (Employer est.)\nWant more listings like these?\nSimilar jobs can have different titles.\nCreate job alerts for related roles.\t\njunior trader\t\nequity research intern\t\nmaterials engineer intern\t\nLooking for something a little different?\nYou can edit your job alert here.\nTrader Intern\n\tSingapore\n\tSent Daily\nThis message was sent to  abigailxiaojun@gmail.com.\nPrivacy Policy | Manage Settings | Unsubscribe\n\nGlassdoor\n300 Mission Street, 16th Floor, San Francisco, CA 94105, USA\n\nCopyright © 2008-2024, Glassdoor LLC. \"Glassdoor\" and logo are registered trademarks of Glassdoor LLC.",
        "Category": "Marketing"
    },
    {
        "Sender Address": "CPF Board",
        "Sender Name": "intouch@e.cpf.gov.sg",
        "Subject": "Central Provident Fund Board Singapore",
        "Content": "Dear CPF Member,\n\nBudget 2024 highlights: CPF and your future needs\nBudget 2024 highlights: CPF and your future needs\nWondering about the recently announced changes to the CPF system and their impact on your future?\n\nEven if the changes don’t immediately affect you, it’s still crucial to understand them as they are integral to the financial plans of many Singaporeans.\n\nLearn how the changes, such as the one-off MediSave Bonus, are designed to help secure your future!\n\nFind out what these changes mean for you\nThe basics of financial planning and CPF: getting it right with these building blocks\nRetirement: what role does CPF LIFE play?\nRetirement: what role does CPF LIFE play?\n\nWatch this animated tale about the Garden of LIFE\nFinancial security: why are there so many withdrawal conditions when it comes to your CPF?\nFinancial security: why are there so many withdrawal conditions when it comes to your CPF?\n\nLearn the conditions of CPF withdrawals\nHealthcare needs: how do you manage hospitalisation costs?\nHealthcare needs: how do you manage hospitalisation costs?\n\nFind out how much you may need to pay in cash\nFuture goals: should you start planning in your 20s?\nFuture goals: should you start planning in your 20s?\n\nLearn why Heartland Boy started planning at age 25\nBudget 2024 Highlights: CPF and your financial plans\nWe are trying out a new look to deliver a better experience for you\n\nYour feedback is valuable to us and will help with upcoming designs. Let us know what you think!",
        "Category": "Marketing"
    },
    {
        "Sender Address": "vincent",
        "Sender Name": "vincent@jdsiseditorial.com",
        "Subject": "[JDSIS]Author Invitation| Free| BonView Press Publishing",
        "Content": "Dear Dr. Q. Wu,\n\n \n\nGreetings!\n\n \n\nThis is Vincent Zhou, the associate managing editor of Journal of Data Science and Intelligent Systems (JDSIS, ISSN: 2972-3841).\n\n \n\nThe Journal of Data Science and Intelligent Systems (JDSIS) is an international, peer-reviewed, interdisciplinary journal that provides in-depth coverage of the latest advances in the closely related fields of data science and intelligent systems.\n\n \n\nJDSIS considers researches that focus on data integration, data information and knowledge extraction, and data application in a wide range of fields, including health, education, agriculture, biology, medicine, finance, environment, engineering, commerce, and industry. We launched the very first Inaugural Issue in July 2023. Followed by the second issue in October 2023. We have an excellent team of editorial board members and reviewers, including 39 listed in Top 2% Scientists by Stanford University in 2022.\n\n \n\nHere is the link for you to know more about our journal:\n\nojs.bonviewpress.com/index.php/jdsis\n\n \n\nThe journal is currently free to the authors, and all Article Processing Charges (APCs) are waived until the middle of 2024. We realize that the time of scholars like you is very precious. Once receiving your article, we will process your manuscript for publication as quickly as possible.\n\nJDSIS would appreciate it if we could receive your submission soon, so that we can try to accept it as soon as possible. If you have an available manuscript, you can submit it through the link above.\n\n \n\nThank you very much for your consideration and support. Please feel free to contact me if you have any questions.\n\n \n\nBest regards\n\nVincent Zhou│Associate Managing Editor\n\nJournal of Data Science and Intelligent Systems (JDSIS)\n\nBon View Publishing\n\nUnit 4, 2nd FL, LINK(THM)BLDG, No. 8 Chang Charn Road, Singapore 159637",
        "Category": "Personal"
    },
    {
        "Sender Address": "invitations@linkedin.com",
        "Sender Name": "Isabel Wee Wan Qin",
        "Subject": "I want to connect",
        "Content": "\nLinkedIn\t\nAbigail Lim\nIsabel Wee Wan Qin’s Profile Picture\nIsabel Wee Wan Qin\nPrudential Financial Consultant. I hope to add…\nSingapore\nJun Kiat’s Profile Picture Keith Lim’s Profile Picture Run Juan X.’s Profile Picture\t4 connections in common\nAccept\nView profile\nMore people you may know\nWye Rock Lau’s Profile Picture\t\nWye Rock Lau\nNUS Business Analytics Undergraduate\nView profile\n Vivien He’s Profile Picture\t\nVivien He\nComputer Science and Business Undergraduate at NUS\nView profile\n Shuo Ling Ng’s Profile Picture\t\nShuo Ling Ng\nPenultimate Business Analytics and Economics @ NUS\nView profile\n Anunaya Joshi’s Profile Picture\t\nAnunaya Joshi\nActing CEO at Anun\nView profile\nNever miss an update with the LinkedIn app\nDownload on the App Store  Get it on Google Play\nThis email was intended for Abigail Lim (Penultimate Business Analytics Undergraduate at NUS)\nLearn why we included this.\nYou are receiving LinkedIn invitations emails.\nUnsubscribe   ·   Help\nLinkedIn\n© 2024 LinkedIn Corporation, 1‌000 West Maude Avenue, Sunnyvale, CA 94085. LinkedIn and the LinkedIn logo are registered trademarks of LinkedIn.",
        "Category": "Personal"
    },
    {
        "Sender Address": "Afterpay Research",
        "Sender Name": "noreply@qemailserver.com",
        "Subject": "Afterpay wants to hear from you!",
        "Content": "Hi Qingyang,\n\nAfterpay is conducting market research in order to improve our services.\n\nWe take pride in listening to our customers and strive to do our best by you.\nFor this, we need YOU to tell us your thoughts!\nThis time, we just have 4 quick questions. Do you think you can jump in?\n\nPlease note that by clicking the start survey link, you will be consenting to participate in the survey. The data from this survey will be aggregated and your responses are completely anonymous.\nFollow this link to the Survey:\nTake the Survey\n\nOr copy and paste the URL below into your Internet browser:\nhttps://corexmszrwznczjd9x3m.qualtrics.com/jfe/form/SV_38JrTUeYhhvQ538?Q_DL=mXYTlKw1b1eoMBB_38JrTUeYhhvQ538_CGC_q95SpKklfsxNd1s&Q_CHL=email\n\nThanks,\nYour friends at Afterpay",
        "Category": "Personal"
    },
    {
        "Sender Address": "Starr Financial Advisors",
        "Sender Name": "career.sfa.gla@gmail.com",
        "Subject": "Internship Opportunity at Starr Financial Advisors",
        "Content": "I hope this message finds you well. My name is Wei Hong, and I'm reaching out to you from Starr Financial Advisors. I wanted to inform you about an internship opportunity we have available. At Starr Financial Advisors, we pride ourselves on fostering talent and providing invaluable experiences for individuals passionate about the financial industry. Our internship program is designed to offer hands-on learning, mentorship, and exposure to real-world projects that will help you develop the skills necessary for a successful career in the financial industry. We believe that interns play a crucial role in our organization by bringing fresh perspectives, enthusiasm, and a willingness to learn. As an intern with us, you will have the opportunity to work alongside experienced professionals, contribute to meaningful projects, and gain insights into the inner workings of Starr Financial Advisors. If you are interested in applying for this internship opportunity or would like more information, please don't hesitate to reach out to us at 9177 2359. We encourage you to submit your application at your earliest convenience, as we review applications on a rolling basis. Thank you for considering Starr Financial Advisors for your internship experience. We look forward to the possibility of welcoming you to our team and helping you grow both personally and professionally. Warm regards Wei Hong Recruitment Team Starr Financial Advisors",
        "Category": "Personal"
    },
    {
        "Sender Address": "NUS Student Feedback",
        "Sender Name": "studentfeedback@se.nus.edu.sg",
        "Subject": "Reminder #1: Student Feedback Exercise – AY 2023/2024, Semester 2",
        "Content": "Dear RYU KAIRIN ANAQI SUZUKI,\n\nThis is a gentle reminder about the Student Feedback Exercise. If you are yet to give your feedback, please do so as soon as possible.\n\nIf you are having problem with the link in the original email, you can try the following:\n1) https://canvas.nus.edu.sg/\nGo to Account > Student Feedback to see available evaluation(s).\n2) https://blue.nus.edu.sg/blue\n\nAs a gesture of our appreciation for your participation, you will be awarded course feedback points that will be used as a metric for resolving tie-breaker situations during course allocation.\n\nThank you.",
        "Category": "Personal"
    },
    {
        "Sender Address": "pg@myworkday.com",
        "Sender Name": "P&G",
        "Subject": "P&G",
        "Content": "An online assessment task has been assigned to your candidate home. Please click the link below to sign into your candidate home to continue with the process. Your current candidate status is not able to be considered until this task has been completed.\n\nCandidate Home\n\nIt is very important to complete this task to keep the application process moving forward. To learn more about our application and assessment process visit our career site.\n\nOur Recruitment team is putting comprehensive efforts to enhance candidate experience and ensure candidates are moving fast along the recruitment process. Delay for more than 16 days of completing the assessment can result in removing the task from your home page and withdrawing application.\n\n\nIf you have commitment issues of meeting the deadline,  Please get in touch with your {ENTER_PRIMARY_RECRUITER_EMAIL}.\n\nThanks,\n\nP&G Careers\n ",
        "Category": "Personal"
    },
    {
        "Sender Address": "OSA Hostel Admission Services",
        "Sender Name": "hosteladmissionsvcs@nus.edu.sg",
        "Subject": "Confirmation of AY2023/2024 Semester 2 Stay",
        "Content": "Please do not reply to this email as it is auto-generated.  \n\nThis email contains information that is important to you.? Please read it carefully. \n\n(Note: This email is not applicable to Resident Assistants/ Fellows) \n\n \n\nDear Residents, \n\n \n\nIf you wish to stay for another semester (Semester 2, AY2023/24, 14 January 2024 to 12 May 2024, 12 noon), please pay the acceptance fee of SGD200 during the following period in order to secure your Semester 2 stay: \n\n \n\n18 October (10:00am, Singapore time) to 30 October (11.59pm, Singapore time) 2023 \n\n \n\nOtherwise, your AY2023/24 Semester 2 reservation at your current accommodation will be cancelled and offered to another student.  \n\n \n\nIf you are not staying for Semester 2, your current stay will end on 10 December 2023, 12 noon. ?If you are not staying for Semester 2 but wish to stay for Vacation 1, you are eligible to stay up till 26 December 2023, 12 noon, subject to your submission of vacation stay application and paying your vacation fee by the stipulated deadline.  \n\n \n\nFor more information, please visit the Hostel Admission Services website. \n\n \n\n1. Acceptance Fee \n\n \n\nThe acceptance fee of SGD200 will be used to offset your 2nd semester hostel fees. The remaining hostel and other related fees will be invoiced by the hostel after you have checked in for Semester 2, AY2023/24. \n\n \n\n2. Payment modes \n\n \n\n2.1 Online Payment \n\n2.1.1 Please pay your acceptance fee online at this portal https://uhms.nus.edu.sg/StudentPortal/.  \n\n \n\n2.1.2 Click on “2nd Semester Acceptance Fee Process” on the top menu. \n\n \n\n2.1.3 At “2023-24 2nd Semester Acceptance Fee”, click on the “Apply” button.  \n\n \n\n2.1.4 Accept the terms and conditions. \n\n \n\n2.1.5 The available online payment modes are AMEX, MasterCard, Visa debit/credit cards, Alipay or PayNow.? You may wish to save and/or print the “acceptance fee payment receipt” for your record after making the payment. Upon successful payment, a computer-generated receipt will be sent to your official NUS email account. \n\n \n\n2.2 Manual Payment \n\n2.2.1 If you are unable to pay online, please ensure that you log on to https://uhms.nus.edu.sg/StudentPortal/ and complete the first portion of the 2nd semester acceptance fee process first (refer to above steps 2.1.1 to 2.1.4), before visiting the Student Service Centre (located at University Sports Centre). \n\n \n\n2.2.2 The available manual payment modes are bank draft, cashier’s order, money order, local cheque (Payable to “National University of Singapore”) and NETS.  \n\n \n\n2.2.3 Please indicate your name, student ID number and contact details on the back of the bank draft/cashier’s order/money order/local cheque. \n\n \n\n2.2.4 Payment should reach the address below by 30 October 2023: \n\n \n\nStudent Service Centre \n\nNational University of Singapore \n\nUniversity Sports Centre, USC-03-07? \n2 Sports Drive 1 \nSingapore 117561  \n\n \n\n3. Other Important Information \n\n \n\n3.1 Your accommodation offer is non-transferrable and you are expected to reside in the same accommodation and room type for the entire duration of your stay. \n\n \n\n3.2 You will be allocated to your current (Semester 1) room for Semester 2 if you have confirmed your Semester 2 stay by paying the 2nd semester acceptance fee. The management office will contact you if there is a need to relocate you to another room.?  \n\n \n\n3.3 Upon your successful payment of the 2nd semester acceptance fee, your 2nd semester (AY2023/2024 Semester 2) hostel reservation will be confirmed. \n\n \n\n3.4 You need not submit another application for your Semester 2, AY 2023/2024 stay. \n\n \n\n3.5 After you have paid your 2nd semester acceptance fee and if you wish to extend your vacation stay till 14 January 2024, please apply via UHMS Portal https://uhms.nus.edu.sg/StudentPortal ?from 20 November to 26 November 2023. Alternatively, you can send an email request to your Hostel Management Office. \n\n \n\n3.6 If you wish to check in before the contract start date, please apply via UHMS Portal Early Check-in option at https://uhms.nus.edu.sg/StudentPortal from 22 December to 27 December 2023. Additional charges will apply if you check in before the contract start date. \n\n \n\n3.7 For late check-in after the contract start date, please apply via UHMS Portal under the tab “About Check-in/ Out” - at https://uhms.nus.edu.sg/StudentPortal from 22 December 2023 to 16 January 2024. You will still be liable for the full hostel fees from the contract start date to the contract end date. If you do not inform us before the contract start date, your room will be re-offered to another student and your acceptance fee paid will be forfeited. For more details on check-in/out dates, please click here. \n\n \n\n4. Queries \n\n \n\nFor queries on hostel admission matters (e.g. admission guidelines, application timeline, procedures or login issues etc), kindly contact Hostel Admission Services via www.hosteladmission.nus.edu.sg and click on the “Ask a Question” tab. If you are a new user, please create a new account ID and password. \n\nFor queries on room and facilities at each hostel (e.g. location, operation hours, check-in/out dates or procedures, payment of hostel fees, amenities/facilities, meal plans, where applicable, or maintenance issues etc), please contact the respective Hostel Management Offices. Their contact details are listed at https://nus.edu.sg/osa/contact. \n\n \n\nThank you. \n\n \n\n \n\nHostel Admission Services \n\nOffice of Student Affairs \n\nNational University of Singapore ",
        "Category": "Personal"
    },
    {
        "Sender Address": "OnTheList AU",
        "Sender Name": "contact@au.onthelist.com",
        "Subject": "[Reminder] Christian Louboutin Friends & Family Sale!",
        "Content": "We invite you to the CHRISTIAN LOUBOUTIN FRIENDS & FAMILY SALE.\nBy Appointment only.\n\nDate & Time\n19 MARCH (TUE) 12 PM - 7 PM AEST\n20 MARCH (WED) 9 AM - 7 PM AEST\n21 MARCH (THU) 9 AM - 7 PM AEST\n \nVenue\nLEVEL 9, 309 GEORGE STREET, SYDNEY, NSW 2000",
        "Category": "Personal"
    },
    {
        "Sender Address": "gtan",
        "Sender Name": "gtan@comp.nus.edu.sg",
        "Subject": "Re: Inquiry the presentation about assignment 2",
        "Content": "Dear Shenghan\n\nit is indicated on the last slide of the additional notes.\n\nIt will constitute 10 marks out of the 60.\n\nrgds\n\ngary",
        "Category": "Personal"
    },
    {
        "Sender Address": "jamuna.k@nus.edu.sg",
        "Sender Name": "Jamuna d/o Karuppaiah",
        "Subject": "REMINDER – PAYMENT OF OUTSTANDING HOSTEL ACCOMMODATION/MISC FEES",
        "Content": "Dear Resident\nOur record shows that you have an overdue hostel fees for your student accommodation. Please make payment in full by 31 Mar 2024 using the methods listed below:\nOnline Payment Portals\nPayment Modes / Bank Details\n \n \nhttps://nusfastpay.nus.edu.sg/home/menu https://uhms.nus.edu.sg/students\n-  Credit / Debit card: Amex, VISA, Master card\n-  eNets, Paynow QR, Alipay\n“With effect from 1 Jan 2024, a card/eWallet processing fee of 1% will be applied to all payments made using Visa, MasterCard, Amex, or Alipay. No processing fee is charged for using PayNow QR in NUSFastPay.”\n \nWe would like to advise you that if payment is not made in full by 31 Mar 2024 the following action may be taken:\n·         Your access to your room may be denied.\n·         Your academic results, transcript, degree conferment letter and/or scroll may be withheld.\nFor any enquiries on your hostel fees, you may reach us at\n1.    Email: hs.finance@nus.edu.sg\n(Please indicate your ‘Matric No.’ and ‘Name of Hostel’ in your email subject title)\n2.    Hotline: +65 6601-7878\nDo note the following advice if needed:\n ADVICE FOR STUDENTS\n\n(a)        Financial Aid – Students who need financial aid for their living and / or accommodation expenses may seek advice from the Office of Financial Aid.\n(b)        Students are advised to visit the counselling centre, Masters, Resident Fellows (RF) and Resident Advisors (RADs) if they are facing difficulty in coping with any problems.\n\nYour IMMEDIATE attention and kind cooperation would be greatly appreciated.\n \n \nJamuna (Mdm) :: Management Assistant Officer :: Housing Services of Campus Life Division, University Campus Infrastructure:: Sheares Hall :: National University of Singapore :: 20 Heng Mui Keng Terrace,  Singapore 119618 :: +65-6601 7202 (DID) :: +65-6778 8054 (Fax) :: Jamuna.K@nus.edu.sg(E) ::  Company Registration No: 200604346E",
        "Category": "Personal"
    },
    {
        "Sender Address": "P'ti Saigon Team - P'ti Saigon",
        "Sender Name": "PtiSaigon@hello.sevenrooms.com",
        "Subject": "Thanks very much for coming in, Celia",
        "Content": "Hi Celia,\n\nI hope you enjoyed your visit to P'ti Saigon yesterday and that you had a great meal. \n\nI’d love to welcome you back and give you a chance to try more of our menu again soon. If you are ever planning another meal with us, I’ve included a direct booking link below, to make that easier for you. \n\nP'ti Saigon Bookings\n\nI’ll look forward to seeing you again soon, \n\nThanks again,\nP'ti Saigon Team\n\n\n--\nP'ti Saigon\n52 Ngô Quang Huy, Thảo Điền, Thành Phố Thủ Đức, Thành phố\nNgô Quang Huy, Thành phố Hồ Chí Minh -\nhttps://www.facebook.com/Pti-Saigon-107313903935964/?modal=admin_todo_tour\n\nunsubscribe\n\nmailed by SevenRooms\n\nsevenrooms.com",
        "Category": "Personal"
    },
    {
        "Sender Address": "no-reply@accounts.google.com",
        "Sender Name": "Google",
        "Subject": "Security Alert",
        "Content": "A new sign-in on Mac\n        longja05@gmail.com\nWe noticed a new sign-in to your Google Account on a Mac device. If this was you, you don’t need to do anything. If not, we’ll help you secure your account.\nCheck activity\nYou can also see security activity at\nhttps://myaccount.google.com/notifications",
        "Category": "Personal"
    },
    {
        "Sender Address": "do_not_reply@ica.gov.sg",
        "Sender Name": "ICA",
        "Subject": "Singapore Passport Expiry Notice",
        "Content": "Dear LONG JI-AN, \n\nYour Singapore passport will expire in a few months. Please renew your passport early as most countries require a minimum validity of 6 months for entry.\n\nIf you need a passport, apply for one online at the ICA website via go.gov.sg/passport. You will need your SingPass, a recent digital photograph in JPEG/jpg/png format (refer to Important Notes below), and credit/ debit card/ iBanking/ PayNow details when you renew your passport:\n\nStep 1: Log in with your SingPass at go.gov.sg/passport. Alternatively, others (e.g. your family members) can submit an application on your behalf.\n\nStep 2: Verify your particulars, and upload a recent photo.\n\nStep 3: Pay online and wait for ICA's notification to collect your new passport.\n\nImportant Notes:\n\nFor more accurate facial matching and to avoid delay in your application, your photograph should show a neutral expression, with your mouth closed. Do not use old photographs or 'selfies'. For more information on photo requirements, go to go.gov.sg/photopassport.\n\nIf your passport is lost or damaged, you must report it to ICA immediately. If the loss was due to crime, you should make a police report. Find out more at go.gov.sg/passport.\n\nPlease ignore this email if you have already renewed your passport.\n\nThank you.\n \n\nYours faithfully,\n\nIMMIGRATION & CHECKPOINTS AUTHORITY",
        "Category": "Personal"
    },
    {
        "Sender Address": "drive-shares-dm-noreply@google.com",
        "Sender Name": "Long Ji-An (via Google Drive)",
        "Subject": "Folder shared with you: ‘IS4242’",
        "Content": "Long Ji-An shared a folder\nUnknown profile photo\nLong Ji-An (longja05@gmail.com) has invited you to contribute to the following shared folder:\n\nIS4242\n\n\n\nLong Ji-An is the owner\n\nLast edited by Ryu Suzuki 2 days ago\nOpen\nIf you don't want to receive files from this person, block the sender from Drive",
        "Category": "Personal"
    },
    {
        "Sender Address": "aniqkahar - Carousell\n ",
        "Sender Name": "carousell-8b0c-1a3364-1a37694a0@mail.carousell.com\n",
        "Subject": "aniqkahar sent you message(s) about Nike Tee\n",
        "Content": "aniqkahar: where do you deal bro\n\nReply now\nCarousell\nThis is automated. Hit 'Reply' to respond to the above message.\nOr use the Carousell app. Got feedback or need help? Contact us via this form.",
        "Category": "Personal"
    },
    {
        "Sender Address": "Team Ausdroid",
        "Sender Name": "unimelbausdroid@gmail.com",
        "Subject": "Fwd: Your Invitation to Ausdroid Annual End-of-Year Celebration",
        "Content": "Dear Ausdroid Club Members,\n\nHope you're all doing well. Just a quick reminder that the registration for our end-of-year event closes by this Thursday. If you're keen to join, please make sure to RSVP.\n\nIt's an event for everyone, please don't hesitate to come along and join in the fun!\n\nKind regards,\nGuang and Murphy\n\nAusdroid AI & Robotics Club\nLevel 3, 700 Swanston St (Melbourne Connect),\nCarlton, VIC 3053\nWebsite: Ausdroid.co  E: UnimelbAusdroid@gmail.com",
        "Category": "Personal"
    },
    {
        "Sender Address": "Lazada Singapore",
        "Sender Name": "noreply@support.lazada.sg",
        "Subject": "Hey Celia Wu, your order is confirmed!",
        "Content": "Hi Celia Wu,\nThank you for ordering from Lazada!\n\nWe’re excited for you to receive your order #120254916943419 soon and will notify you once it’s on its way. If you have ordered from multiple sellers, your items will be delivered in separate packages. We hope you had a great shopping experience! You can check your order status here.",
        "Category": "Updates"
    },
    {
        "Sender Address": "notify@detrack.com",
        "Sender Name": "KoKo Delivery",
        "Subject": "Your Delivery Status Update [Delivered] [#TDB49574]",
        "Content": "Hi Ji-An Long,\n\nYour delivery has been completed. Details of your delivery:\n\nD.O. #: #TDB49574\nStatus: Delivered\nDate & Time: Tue, 13-Feb 2024, 12:44pm",
        "Category": "Updates"
    },
    {
        "Sender Address": "firebase-noreply@google.com",
        "Sender Name": "Firebase ",
        "Subject": "[Action Advised] Enable email enumeration protection on all of your Firebase projects",
        "Content": "Hi Long,\nWe’re writing to let you know that to increase the default protection against email enumeration attacks, all new projects created after September 15, 2023 will now have email enumeration protection enabled. Additionally, we recommend you to enable email enumeration protection on your existing projects as soon as possible.\n\nWhat do you need to know?\nEmail enumeration is a type of brute-force attack in which a malicious actor attempts to guess or confirm users in a system by passing an email address to the API and checking the response. Starting September 15, 2023, we’ve enabled email enumeration protection on all new projects. Existing projects were unchanged, but it is recommended that you enable this protection on all existing projects to protect your apps against credential stuffing attacks.\n\nWhat do I need to do?\nWe highly recommend enabling email enumeration protection on all your projects after testing with your app.\n\nIf you currently utilize fetchSignInMethodsForEmail (doc examples: Java, JS, Swift), your projects will be affected. When email enumeration is enabled, the fetchSignInForEmail API will fail. Linking anonymous authenticated users with an email address will also not work prior to SDK version 22.3.0 for Android, 10.18.0 for iOS, and 10.6.0 for Web.\n\nA full list of affected flows is also available for review.\n\nAdditionally, FirebaseUI libraries first run fetchSignInMethodsForEmail before allowing a user to sign in with their preferred method. If you have a dependency on the library, you should evaluate impact before enabling email enumeration detection. Once FirebaseUI libraries are updated (issue 1, issue 2, issue 3, issue 4), you should enable email enumeration protection.\n\nOne or more of your projects have Firebase Auth or Google Cloud Identity Platform enabled.\n\nWe’re here to help\nIf you have any additional questions, please look through our documentation center.\n\nThanks,\nMicah on behalf of the Firebase team",
        "Category": "Updates"
    },
    {
        "Sender Address": "Dodee Paidang Lt.Collins",
        "Sender Name": "Customerservice@dodeepaidang.com",
        "Subject": "We have temporary moved during our renovation.",
        "Content": "Dear Customer\n\n\n\n\n​​​​​​​It's been six years! During this time we can't thank you enough. To keep with the times we feel it's time our restaurant has a makeover. During this, we will be moving to Dodee Swanston upstairs level 1, 243 Swanston Street Melbourne. We can't wait to see you back no later than the 31st of March. Thanks so much for your support and look forward to serving you soon.\n\nThanks\n​​​​​​​Dodee Team\n\n\n\n\n\n13 Feb - 30 March\n\n\n We have temporary moved  during our renovation   \nTo Level 1, 243 Swanston Street",
        "Category": "Updates"
    },
    {
        "Sender Address": "support@t.dowjones.com",
        "Sender Name": "Dow Jones ",
        "Subject": "Update to Terms of Use",
        "Content": "Dear Reader: \n\nWe are writing to let you know that as of March 18th, 2024, we have updated our Terms of Use, formally known as the Subscriber Agreement and Terms of Use. These updates apply to the following Dow Jones products and services: The Wall Street Journal, Barron’s and MarketWatch. \n\nBelow is a summary of some of the key changes:\nMade our Terms of Use easier to understand, including providing more clarity regarding our subscription practices and policies;\nAdded information regarding our products and services, including our bundled services;\nRevised our arbitration clause, which covers any disputes relating to our Terms of Use and your relationship with us.\nWe encourage you to review the updated Terms of Use. By continuing to use our products and services, you agree to our updated Terms of Use. The updated Terms of Use will be available to you anytime you need it through the links on our home page and each respective product page. \n\nNote: This is a legal notice, which is why you are receiving it even if you have opted out of Dow Jones marketing and promotional emails. ",
        "Category": "Updates"
    },
    {
        "Sender Address": "OKX",
        "Sender Name": "no-reply@us.greenhouse-mail.io",
        "Subject": "Thank you for your interest in joining OKX",
        "Content": "Thank you so much for your interest in the Senior BI Analyst role at OKX, we regret to inform you that we’ve decided to move forward with other candidates who we feel more closely fit our needs at this time. Our company is growing and we hope you’ll keep us in mind and we encourage you to apply again in the future, or if we find a role that aligns with your skills we will reach out to you! Thanks again for your interest in OKX, we wish you the best of luck in your job search and future endeavors! Sincerely, OKX Recruiting Team",
        "Category": "Updates"
    },
    {
        "Sender Address": "store+14073856100@t.shopifyemail.com",
        "Sender Name": "Medicube SG",
        "Subject": "Order confirmed",
        "Content": "Thank you for your purchase!\nWe're getting your order ready to be shipped. We will notify you when it has been sent.\n \nView your order\nor Visit our store\nOrder summary\n\n        Collagen Niacinamide Jelly Cream × 2\nCream\n$59.80\nSubtotal\n$59.80\nShipping\n$0.00\nTaxes\n$0.00\nTotal\n$59.80 SGD\nCustomer information\n\nShipping address\nSingapore\nBilling address\nSingapore\nPayment\nGrab checkout\nShipping method\nFree Standard Shipping (3~4 Business Days)( Shipping Agency: Ninjavan)\nIf you have any questions, reply to this email or contact us at medicubesg_cs@apr-in.com",
        "Category": "Updates"
    },
    {
        "Sender Address": "bard-noreply@google.com",
        "Sender Name": "Bard",
        "Subject": "Bard is now Gemini",
        "Content": "Bard is now Gemini\nBard is now known as Gemini, the best way to get direct access to Gemini models. You can chat with Gemini to supercharge your ideas. Learn more in our blog post.\nPlease note that:\n•        This branding update does not change your Activity and Extension settings\n•        Your data is handled as explained in the Google Privacy Policy and the Gemini Apps Privacy Notice, which are updated to reflect these branding changes, and the availability of Gemini as a mobile app\n•        Your use remains subject to the Google Terms of Service and the Generative AI Additional Terms of Service\nLearn more details about how your data is handled in the Gemini Apps Privacy Hub.",
        "Category": "Updates"
    },
    {
        "Sender Address": "\nhailing@tada.global",
        "Sender Name": "\nhailing@tada.global",
        "Subject": "[TADA] Receipt",
        "Content": "Receipt\n\nTotal Fee Charged\nSGD 40.04\nRide Fare\nSGD 37.4\nPlatform Fee (incl. GST)\nSGD 0.82\nDriver's Fee\nSGD 0.8\nPayment Transaction Fee\nSGD 1.02\nPick-up Date and Time\n2024-02-04 01:34 ~ 02:07\nRide Type\nAnyTada\nDriver's Name\nPushparaj Ramasamy\nPassenger's Name\nJi-An Long\nBooking Code\n0b152570-b8d8-4759-8984-3cc0015e1394\nPick-up Location\nSri Veeramakaliamman 141 Serangoon Road, (S)218042\nAdditional Stop\n317 SEMBAWANG VISTA (S)750317\nDrop-off Location\nROSEWOOD 1 ROSEWOOD DRIVE ROSEWOOD (S)737934\nPayment Method\nCreditCard Visa ****6743\n\n",
        "Category": "Updates"
    },
    {
        "Sender Address": "ShopBack",
        "Sender Name": "hello@info.shopback.sg",
        "Subject": "Your ShopBack Pay receipt - $5.80",
        "Content": " \t\n65 Pasir Panjang Road\nSingapore 118506\n\nTax ID: 201411189G\n\nThanks for shopping smarter with ShopBack.\n\nHere’s the receipt for the payment you made at Peng Tiong Bahru Wanton Mee (Market Street Hawker Centre) using ShopBack Pay. You can also find payment and reward details in the ShopBack app.\n\n \t \n \t \t \tPayment details\t \t \t \n \t \t \tOrder ID 240404-4716-GGAH\nPayment date 4 Apr 2024, 12:17 PM\t \t \t \n \t \t \t\t \t \t \n \t \t \tPayment made at:\nPeng Tiong Bahru Wanton Mee (Market Street Hawker Centre)\t \t \t \n \t \t \t\t \t \t \n \t \t \t Payment summary\t \t \t \n \t \t\nPayment method\t\n \t \t \n \t \t\nSubtotal (incl. GST)\t$5.80\n \t \t \n \t \t\nCashback used to offset payment\t-$0.00\n \t \t \n \t \t \t Cashback and loyalty\t \t \t \n \t \t\nCashback confirmed from last visit\t$0.17\n \t \t \n \t \t\nCashback pending from this visit\t$0.17\n \t \t \n \t \t\nTotal paid\t$5.80\n \t \t \n \nNeed help?\nUpdate settings >\t\nWithdraw Cashback >\t\nReport missing Cashback >\t\nHelp centre >",
        "Category": "Updates"
    },
    {
        "Sender Address": "info@mailing.ticketmaster.sg",
        "Sender Name": "Ticketmaster Singapore",
        "Subject": "Your Event Guide to Coldplay: Music Of The Spheres World Tour – Delivered by DHL in Singapore!",
        "Content": "\nTo ensure a smooth experience at Coldplay: Music Of The Spheres World Tour - delivered by DHL on 23, 24, 26, 27, 30 and 31 January 2024 at the National Stadium, please note the following measures.\n \nArrive Early and Take Public Transport\nAs we are expecting a high volume of visitors on event day, we strongly recommend that you take public transport and come early. Patrons are advised to take public transport and arrive at least one hour before the show starts. For public transport options, check out www.sportshub.com.sg/directions-and-map.\n\nTicket Collection\nTicket Collection will be available at the following locations on the day of the event:\nSingapore Indoor Stadium Box Office – 1PM to 9PM  \n(Dedicated counter for Infinity & Enhanced Experience ticket holders only.)\nKallang Wave Mall Box Office – 3PM to 9PM\n \n\nE-Tickets\nRetrieve the Print-At-Home ticket(s) from your Ticketmaster account in advance! Do NOT screenshot or take photos of your PAH ticket(s). Instead, either download and save the PAH ticket(s) in PDF format and present them via your mobile device OR have them printed out on A4-sized paper. This will help to ensure a seamless entry into the venue.\n\nInfinity Ticket Holders and Enhanced Experiences Package Holders\n\nWristband Redemption: \nAll Enhanced Experiences (Ultimate Spheres Experience, Supersolis Experience, and Kubik Experience) package holders must redeem their wristbands before admission. \nLocation: Singapore Indoor Stadium Box Office \nTiming: 1PM to 9PM\nRedemption will take place on show days only. \nPlease prepare your ticket(s) upon wristband redemption.\n \nInfinity Ticket Collection: \nAll Infinity ticket holders are to collect their tickets before admission.\nLocation: Singapore Indoor Stadium Box Office \nTiming: 2PM to 9PM \nRedemption will take place on show days only. \n \nDedicated Merchandise Booths: \n\nColdplay Gift Item Redemption: \nLocation: Merchandise Booth at Stadium Riverside Walk \nTiming: After show ends until 12:30AM \nPlease present your wristband upon collection. \nEnhanced Experience gift redemption must be done on the same day at the venue. All uncollected items will be forfeited. \n \nUltimate Spheres Experience Backstage Tour & Admission:\nTicket holders of Ultimate Spheres Experience are to gather at Gate 6 (Level 3) at 4:30PM for the exclusive “Once-In-A-Lifetime Backstage Tour”.\nThere will be a briefing and a security check process.\nLate-comers will not be guaranteed access to the experience with no refund requests available.\nThe dedicated entrance for the Ultimate Spheres Experience ticket holders is located at 100PLUS Promenade, Gate 11 (Level 3). Ticket holders can enter the venue when the gates open at 6PM. \n \nSupersolis Experience Admission: \nTicket holders of Supersolis Experience can enter the venue via 100PLUS Promenade, Gate 11 (Level 3) when gates open at 6PM.\nEntry to the venue is subject to security checks. \n \nKubik Experience Admission: \nTicket holders of the Kubik Experience Standing Area can enter the venue via 100PLUS Promenade, Gate 2 (Level 3) when gates open at 5:15PM.\nEntry to the venue is subject to security checks. \n \nNote: The schedule and timing are subject to change based on on-site situations.\nGeneral Standing Area Admission\n\nTicket holders of the General Standing Area can enter the venue when the gates open at 5:30PM. \nEntry to the venue is subject to security checks. \n\nSeated Area Admission\n\nTicket holders of the General Seated Area can enter the venue when the gates open at 6PM.\nEntry to the venue is subject to security checks.\n \nSecurity Checks & Admission Rules\n\nTicket holders can proceed to the security check point at the following timings: \nStanding Area Ticket Holders: 4PM \nGeneral Seated Area Ticket Holders: 5:30PM\nAdmission to show/venue by full ticket only. Printed/electronic tickets must be produced for admission.\nThere will be security checks at the designated security check points. Patrons are advised to check the gate number on their tickets in advance, arrive early and head to the designated security check points on arrival.\nThe following will not be allowed into the venue:     \nOutside food and drinks \nNon-collapsible umbrellas\nLiquid containers and personal water bottles (except for glass and steel water bottles) are allowed, but they must be emptied before entry.  \nBags exceeding 35cm x 20cm x 30cm (i.e., too large to be stored under a seat)\nNoise makers including but not limited to air horn, whistle, etc.\nCountry flags, placards and banners with offensive slogans, political messages or advertisement.\nFan boards sized bigger than 42cm x 29.7cm (A3)\nChairs and stools\nPatrons with prohibited items such as vapes and cameras will be denied entry.\nFood & beverages are available for sale inside the venue.\nWe reserve the right to refuse entry to any person who does not comply with security check requests.\n\nChild Policy\nChildren aged 6 years old and above will be required to purchase a ticket for admission.\nNo admission for infants in arms and children below 6 years old.\nChildren under 12 years old by date of birth or below 1.2m in height are not allowed into the standing areas.\n \nAudio, Photography & Videography Policy\nNo professional photography and videography.\nStrictly no cameras, video cameras, zoom lens, GoPros, iPads and tablets.\nNo selfie sticks, tripods, monopods and gimbals.\nNo camera equipment.\nLive streaming of event is prohibited.\n\nMerchandise Booth\n\nLocation & Operating Hours: \nOCBC Square (Level 1) – 11AM onwards\nStadium Riverside Walk (Level 1) – 11AM onwards\nSouth Dome Deck (Level 3) – 4PM onwards\nNational Stadium, Gate 3, 9 & 21 (Level 3) – 5:30PM to 9PM\nSouth West Tunnel (Level 1) – 5PM to 10PM\nPayment Terms: Cashless Payment Only – VISA, Mastercard, PayNow, ApplePay, GooglePay, Samsung Pay. Cash will NOT be accepted.\nWhile stocks last.\nRefunds/exchanges are only applicable to damaged or defective items that are purchased at the concert site, so please check your items before leaving the counter.\nStrictly no refunds/exchanges will be made once you leave the counter.\nThe organiser reserves the right to amend these Terms and Conditions.⁠ \n\nHydration Points\n\nEnsure you stay hydrated during the event. Water points are available at the following locations: \nWater Point Sales\n100PLUS Promenade (Level 3):\nBetween Gate 10 & 11\nBetween Gate 22 & 23\nWater Coolers\n100PLUS Promenade (Level 3):\nBetween Gate 3 & 4\nBetween Gate 15 & 16\nNational Stadium: \nLevel 3 – Behind Sections 109, 117, 122, 128, 134 and 142\nLevel 4 – Behind Sections 410, 416, 435 and 441\nLevel 6 – Behind Sections 608 and 643\n \nReduce your emissions by traveling green to and from the show!\nTravel via Public Transportation\nThe Stadium MRT Station (CC6) exits directly into the Singapore Sports Hub via the Circle Line. \nKallang MRT Station (EW10) is approximately 600m to Singapore Sports Hub, under a sheltered walkway via the East West Line.\n \nTake one of Grab's many options, including:\nGrabShare - 30% cheaper and a great way to reduce your emissions!\nPLUS, do your part by sharing a ride to the show and receive a FREE 24-hr Anywheel bike pass \nClick here for more information\n \nGrab's FREE Post-Concert Shuttle Bus - departing in 15-30 minute intervals, between 9:30 pm and 12 am. Head to Pick-Up Point A by National Stadium Gate 14 and look out for signs. *Seating limited and will be on a first-come, first-served basis\n \n\n\n⚬ Click here for more information\nAnywheel bike rental, available around the city\nAll information is correct at the time of publishing but subject to change.\nEvent Guide\n\n \nFacebook Twitter  Instagram\nTicketmaster.sg | My account\nPlease do not reply to this email, as we will unfortunately not be able to respond. If you have any questions, visit our help pages. \n© 2024 Ticketmaster-Singapore Pte. Ltd. GST# 201313980N. All rights reserved.\n2 Stadium Walk, Singapore Indoor Stadium, Singapore 397691.\nOur emails contain technologies to track how you interact with them. We do this to help improve our emails and for online behavioural advertising purposes. For further information, including how to disable such technologies, please see our privacy and cookies policies.",
        "Category": "Updates"
    },
    {
        "Sender Address": "HSBC",
        "Sender Name": "HSBC@messaging.hsbc.com.au",
        "Subject": "Qingyang, to protect you from fraud and scams, we’re making changes to how you manage payment limits",
        "Content": "We're making changes to help protect you from scams\nHi Qingyang,\nAs an HSBC customer, you should always feel your money is in safe hands with HSBC.\nWe're introducing new measures to make sure it stays that way and keep your accounts\nsecure from the growing threat of scams affecting Australians every day.\nStaying one step ahead of scammers\nImpersonation scams are on the rise across the banking industry and we're seeing an increase in scammers contacting customers, pretending to be from HSBC. Scammers use illegal technology and might try to contact you in the same text message thread that has legitimate messages from HSBC. They can also impersonate someone you trust like a government official, a family member, or an organisation like a bank. They try to trick you into sending money or personal information and pressure you to act quickly.\nDaily Payment Limits feature\nWe're removing the ability to change daily payment limits on HSBC Online Banking and the HSBC Mobile Banking app.",
        "Category": "Updates"
    },
    {
        "Sender Address": "ApiaryBuzz",
        "Sender Name": "support@apiarybuzz.com",
        "Subject": "[Apiarybuzz] Honeydrop Point Expiry Update",
        "Content": "Dear ApiaryBuzz Members, As of July 1st 2024, we'll be updating our points validity policy. Current Policy: Points earned through ApiaryBuzz are currently valid for 24 months. New Policy: Starting on July 1st 2024, points will be valid for 12 months. Points earned before or after 1st July 2024 will be valid for 12 months. This change is to encourage more active engagement and utilization of the earned points as well as ensure that all users get a better experience out of it We understand this change may take some time to adjust to, if you have any questions, you may reply to this email or reach out to us via our socials. You can easily check your points balance and their expiration month in Statement within the app. Thank you for being a valued user of ApiaryBuzz! Sincerely, ApiaryBuzz Team",
        "Category": "Updates"
    },
    {
        "Sender Address": "\ninfo@mail.shopee.sg",
        "Sender Name": "Shopee",
        "Subject": "Your order #24031319C8Q0X8 has been delivered",
        "Content": "\nHi ryuniqlo,\n \nWe are pleased to inform you that #24031319C8Q0X8 has been delivered.\n\nPlease confirm and accept the order in the Shopee App before your Shopee Guarantee Period expires. Once you confirm, payment will be made to sfsjersey2.sg. If we don’t hear from you within this period, payment will be automatically transferred.\n \n \n \n \nORDER DETAILS\n \n \nOrder ID:\t#24031319C8Q0X8\nOrder Date:\t13/03/2024 23:53:55\nSeller:\tsfsjersey2.sg\n \n \n \n\n \n \n1. 【SFS】Top Quality 2024 Yokohama Marinos Soccer Football Jersey T-shirt S-2XL Sports Jerseys Loose Fans Version\nVariation:\tBlue,L\nQuantity:\t1\nPrice:\tS$19.98\n \n \n \nSubtotal:\tS$19.98\nShipping Fee:\tS$1.49\nTotal Payment:\tS$21.47\n \n \n\n\n \nFAQ\n \nWhat if I did not receive my order or received it but there are some problems?(i.e missing, wrong, damaged products)\nIf you encounter any issues with #24031319C8Q0X8, we apologize for the inconvenience. Feel free to reach out for further assistance by requesting a return/refund through the Shopee App / Website within 15 days upon receiving the order.\n\nFor more information about the return/refund process, please visit here.\n\nWe hope you enjoyed your purchase!\n\nCheers,\nShopee Team\n\n\nNeed help? Contact us here.",
        "Category": "Updates"
    },
    {
        "Sender Address": "edm@jfh.com.sg",
        "Sender Name": "JapanFoodsHolding Membership",
        "Subject": "JFH Rewards Monthly Statement",
        "Content": "Membership Monthly Statement\n\nDear Abigail Lim,\n\nAs at 9am of 1 April 2024, your $J balance at a glance is as follows:\n\nActive Points: 0.00\nActive Cycle Ends: 2025-03-26\n\nPoints in Grace Period: 0.00\nGrace Period Ends: 2024-04-26\n\nOur membership is free for a lifetime. However, please be reminded that $J has a one-year validity cycle from the date of registration. Expired $J can be used within one-month grace period before it resets to zero. For example, a member who joins on 5 July 2024 will have all unused $J expire on 4 July 2025. Members have a grace period of one month to consume their expired $J, ie., if your $J expires on 4 July 2024, you have up to 4 August 2024 to consume it. No extension will be given after the grace period for expired $J. The reset will not affect $J earned in the new cycle. You may logon members.jfh.com.sg to check your point expiry and transaction history .\n\nPlease use your $J to enjoy food hunts with Japan Foods Holding! Check out our store locations at: https://jfh.com.sg//html/contact_stores.php. For any membership enquiries, please send an email to membership@jfh.com.sg. Once again, we thank you for joining our community and we hope you enjoy our membership privileges. We look forward to hosting you at our restaurants. See you.\nJFH Rewards\nWebsite: https://www.jfh.com.sg/html/jfhrewards.php\nEmail: membership@jfh.com.sg\nYou have received this email as a JFH Rewards member. If you would prefer to opt out of future promotional emails, click click here. Please do not reply directly to this system-generated email. If you would like to manage your subscription for sms or emails, please click here.",
        "Category": "Updates"
    },
    {
        "Sender Address": "Trek & Explore Singapore",
        "Sender Name": "info@email.meetup.com",
        "Subject": "📅 Just scheduled: Walk @ Botanic Garden to Queenstown",
        "Content": "Trek & Explore Singapore scheduled a new event\n\nImage\nWalk @ Botanic Garden to Queenstown\nSaturday, march 23, 2024 3:45 PM - 6:45 PM\nImage Botanic Gardens MRT Station (CC19)\nRSVP now\nDetails: Join us for walk at Botanic Garden to Queenstown - Botanic Garden - Forest Walk - Learning Forest Walk - Dempsey Hill - Kay Siang Road This is a leisure and a nature watch activity. Meet: Botanical Garden MRT Time: 03:45 pm Date: 23rd March 2024 Wait: MRT Exit A near Botanical Garden Gate Note: If raining walk will be delayed or change of wal...\nHosted by:\nTham Kok Cheong",
        "Category": "Updates"
    },
    {
        "Sender Address": "farfetch@email.farfetch.com",
        "Sender Name": "FARFETCH",
        "Subject": "Are your account preferences up to date?",
        "Content": "UPDATE YOUR ACCOUNT PREFERENCES\nYour data security and privacy rights are important to us. We pledge to handle your data fairly and legally at all times and want to be as transparent as possible about what data we collect about you and how we use it. From time to time, we check that the data we hold about you is correct.\n\nTo update your account preferences, click here.\n\nYou are not currently subscribed to FARFETCH. To sign-up to receive our emails including personalised offers and other promotions, click here.\n\nFor more information on how we use your personal data, click here.\n\nThank you, Your FARFETCH team",
        "Category": "Updates"
    },
    {
        "Sender Address": "Google",
        "Sender Name": "no-reply@accounts.google.com",
        "Subject": "Security alert\n",
        "Content": "A new sign-in on Mac\n        ryuanaqi@gmail.com\nWe noticed a new sign-in to your Google Account on a Mac device. If this was you, you don’t need to do anything. If not, we’ll help you secure your account.\nCheck activity",
        "Category": "Updates"
    },
    {
        "Sender Address": "Midjourney Inc",
        "Sender Name": "invoice+statements@midjourney.com",
        "Subject": "Your refund from Midjourney Inc #3394-8781-5450",
        "Content": "Your refund from Midjourney Inc #3394-8781-5450‌Midjourney Inc",
        "Category": "Updates"
    },
    {
        "Sender Address": "Spotify",
        "Sender Name": "no-reply@spotify.com",
        "Subject": "Confirm your account",
        "Content": "WELCOME TO\n\n\nSPOTIFY.\n\n\nCONFIRM YOUR ACCOUNT\n\n\nKeep your account secure.\n\n\nConfirm below and enjoy the music and podcasts you love.\n\n\nconfirm now\n\n\nIf you're having trouble viewing the button above, please click this link instead.\n\n\nGet Spotify for:  iPhoneiPadAndroidOther\n\n\nThis message was sent to celiai@qq.com. If you have questions or complaints, please contact us.\n\nTerms of UsePrivacy PolicyContact Us\n\nSpotify AB, Regeringsgatan 19, 111 53, Stockholm, Sweden",
        "Category": "Updates"
    },
    {
        "Sender Address": "Chope reservation",
        "Sender Name": "noreply@chope.co",
        "Subject": "Reservation reminder for JYPSY One Fullerton today",
        "Content": "Dear Chase Ng, This is a friendly reminder that you have a reservation today at JYPSY One Fullerton. Please ignore this email if you've contacted the restaurant directly to edit or cancel your reservations. Name\tChase Ng Date & Time\t8:15 pm # of Covers\t2 Confirmation ID\tSCMKO Edit/Cancel\tClick here to EDIT/CANCEL your reservation Address\t1 Fullerton Road 01-02/03 Singapore (049213)  Map Telephone\t6708 9288 JYPSY One Fullerton Jypsy at One Fullerton is a contemporary Japanese restaurant with a stunning harbour view. An elegant and relaxing ambience welcomes a crowd of yuppies who love Jypsy’s take on Japanese cuisine with a twist. With Jypsy’s menu of sharing portions, intimate dinners or ... ... More Email\tconcierge@pscafe.com Please note that your reservation will only be held for 15 minutes and we cannot guarantee your reservation after this time.",
        "Category": "Updates"
    },
    {
        "Sender Address": "noreply+14d70585cadd4141c273da3b71a9803901cdaca56906cc43f3daadda@am.atlassian.com",
        "Sender Name": "Trello",
        "Subject": "Verify your email for Trello",
        "Content": "Trello\n\nYou’re nearly there!\nHi,\n\nTo finish setting up your account and start using Trello, confirm we’ve got the correct email for you.\n\nVerify your email\nYour Atlassian Account\nMake things easier by using one account across all of your Atlassian products. Learn more.\n\nThis message was sent to you by Atlassian Cloud\nAtlassian",
        "Category": "Updates"
    },
    {
        "Sender Address": "DBS",
        "Sender Name": "DoNotReply-DBS@recruitment.dbs.com",
        "Subject": "Associate, DevOps Engineer, EASRE, Technology & Operations – Thank You",
        "Content": "Thank you for your interest in the Associate, DevOps Engineer, EASRE, Technology & Operations - WD62852. We have assessed your application and we regret to inform you that we will not be moving forward with your candidature. There were other candidates that had a closer fit to the role that we were looking to fill. This decision will not affect the outcome of your other job applications with DBS.  Your resume will remain active in our database for a year and we will contact you if a suitable position is available in the future. Once again, thank you for your interest in a career with DBS and we wish you every success in your future endeavours. Best regards, DBS Human Resources",
        "Category": "Updates"
    },
    {
        "Sender Address": "Wise",
        "Sender Name": "notification@wise.jobs",
        "Subject": "Thank you for applying to Wise",
        "Content": "Thank you for showing an interest in our Mission and for taking the time and effort to apply for the Product Analyst - Payment Operations position at Wise. Here’s what happens next: Application Review: Our recruitment team will evaluate your application against the role requirements. We will let you know the outcome within a week of receiving your application. Assessment Process: Shortlisted candidates will be invited for further evaluation, which may include interviews, skill assessments, or other relevant steps. Candidate Selection: Following a comprehensive interview process, we will select the most qualified individual for the position. While you wait to hear the outcome of your application review, we recommend keeping an eye on your email inbox. Sometimes, our messages might land in a spam or junk folder, and we wouldn't want you to miss any important updates. If you would like to discuss any accessibility-related adjustments, have any disabilities or require any accommodations in the recruitment process, please email adjustments@wise.com. Thanks and good luck! The Wise Recruitment Team",
        "Category": "Updates"
    },
    {
        "Sender Address": "JurongPoint@anytimefitness.sg",
        "Sender Name": "Anytime Fitness Jurong Point",
        "Subject": "Price Increase excerise 2024(Existing member completed Minimum Term)",
        "Content": "Price Increase from 1 Jan 2024 – Existing Members\n \n\nReason for Price Increase for Existing Members\n\nAnytime Fitness pride ourselves as one of the more affordable 24/7 gym membership provider in Singapore and we hope to continue to provide the best value while offering competitive rates against our competitors. Since our establishment in 2013, Anytime Fitness has maintained our pricing for 10 years. However, after careful calculations and hearing feedback from franchisees, we have decided to provide clubs the opportunity to increase their price for existing members who have completed their minimum commitment period to help the clubs survive the rising cost and inflation. Factors that contributed to the price increase:\n\na) To compensate inflation throughout the years - Anytime Fitness clubs has been absorbing inflation cost for the past 10 years since 2013. As the profit margin gets lower and lower, we need to increase our membership prices so that we can continue to support our members and deliver the best fitness experience across all clubs.\nb) The increase includes the upcoming 1% GST increment for GST registered clubs.\n​​​​​​​c) Increase in operational costs - Which includes, but not limited to; electricity cost, rental costs, and staff/manpower cost and others.\n\n\n\n\nFrequently Asked Questions\n\n(All AF clubs are owned and managed separately. The Price Increase Exercise is in-line with guidelines set by AF Singapore, AF’s corporate office. Clubs are implementing this at their own timeline and discretion)\n \n\nQ :    As a loyal member for so long, why am I affected by the price increase?\n\nA :    We truly appreciate your support to the club. While it is our wish to always maintain loyal member’s membership fees, it has become unsustainable for the clubs in the long run. To ensure that the club can continue operating, this price increase exercise is inevitable. \n\n \n\nHowever, you can be assured that all existing members will still pay less than the current fees that new members are paying (standard membership of a 12-month plan is now @$118/month). You may refer to the pricing table for the details.\n\n \n\nQ :     Where will the additional membership fees be spent?\n\nA :     The additional fees collected will cover increased inflation costs, like rental, utilities, manpower and operating expenses. This is necessary so that we can help your favourite Anytime Fitness club(s) continue with their operations without having to sacrifice the quality of our members’ experiences.\n \n\nQ:    Why am I being notified just before the price increase in the following month?\n\nA :     The Price Increase Exercise is planned in-line with corporate guidelines, and your AF membership agreement. Clubs have to give 14 days' notice before adjusting fees. You may refer to your agreement for this clause :  \n\n\n\n \n\nQ :     Can I re-contract to a membership plan that is cheaper than my current one? - If you quality, you may do so before your next billing month (April 1, 2024 in this case)\n\nA :     Yes you can! If you qualify for the following memberships that are cheaper than your current one, please visit our club office and talk to our team for a re-contract : \n\nQ :     Can I re-contract my existing plan, and lock down the current rate for another 12 or 18 months? - Yes, please do so before your next billing month (April 1, 2024 in this case, however, terms apply, please read on)\n\nA :     You may also beat this current price adjustment by re-contracting your existing membership before your next billing month (April 1, 2024 in this case). Please contact the club office for assistance,\n\n :     Are all clubs in Singapore increasing their membership prices too?\n\nA :     The price increase exercise is ongoing. Clubs are implementing them at their own timeline and discretion.\n\n \n\nQ :     I would like to transfer to a club that has not increased their prices.\n\nA :     No staff or club can manually process a transfer, as transfers are automated by the system. You will need to utilise another club more frequently than your home club, for a period of 60 days, in order for the system to trigger a transfer. \n\n \n\nHowever, all AF clubs will progressively implement the Price Increase Exercise. This is also in view of the recent GST increase in January 2024 by the government. \n\n \n\nFor the AF brand to stay competitive, all membership prices will progressively increase in all clubs.\n\n \n\nPlease contact our staff on your new monthly fee if required, thank you\n \n\n \n\n\n\n\nFor the purposes of data protection law Membr and Anytime Fitness Jurong Point will be joint controllers of your information, which will be processed inline with Membr’s Data Protection Policy and the relevant sections of Anytime Fitness Jurong Point Privacy Policy.\nClick here if you would like to unsubscribe",
        "Category": "Updates"
    },
    {
        "Sender Address": "noreply@lumihealth.sg",
        "Sender Name": "LumiHealth",
        "Subject": "You’ve been withdrawn from LumiHealth",
        "Content": "You’ve been withdrawn from LumiHealth\nDear JiAn,\n\nThe earlier LumiHealth experience has ended; your account has been withdrawn from LumiHealth, and no further data about you will be collected.\n\nWe'll store the personal information you've already shared with us as outlined in the programme participant agreement.\n\nThere is no further action required from you. To keep participating, please download the latest LumiHealth app from the App Store.\n\nShould you have any clarifications or require further assistance, you can email us at HPB_Mailbox@hpb.gov.sg or call us at 1800 223 1313 during our operating hours from 8 am to 6 pm, Mondays to Fridays (excluding Public Holidays).\n\nBest regards\nTeam LumiHealth",
        "Category": "Updates"
    },
    {
        "Sender Address": "Picanhas'\n ",
        "Sender Name": "\neat@eatapp.co",
        "Subject": "Reservation Confirmed at Picanhas'",
        "Content": "Your reservation at Picanhas' is confirmed!\n\n\nReservation Details\n\n\nName of guest: Ryu Suzuki\nNumber of guests: 3\nPreference: No preference\nTime of arrival: Tue, Mar 26 at 7:00pm\n\n\n\nYour Eat Reservation ID is: BQS12D\n\nView Confirmation | Modify\n\n\n\nReservation QR Code\n\nSpecial Requests\n\n\nNA\n\n\n\nRestaurant Location & Contact Details\n\n\nPicanhas'\n+6597541909\n92 Club Street,\nSingapore, Singapore\n\n\nAdditional Details & Terms\n\n\n\nIf you want to make any further reservations, simply navigate to your upcoming reservations on Eat App's mobile app\n",
        "Category": "Updates"
    },
    {
        "Sender Address": "noreply@email.apple.com",
        "Sender Name": "Apple",
        "Subject": "You only have 25% of your iCloud storage left",
        "Content": "Hello Ji-An Long,\nThank you for using iCloud to keep the most important information on your iOS devices safely stored. You have less than 25% of your free 5 GB of iCloud storage left.\nFor $1.48 per month, you can get iCloud+ with 50 GB of storage. Get more storage.\nYou are using iCloud Photos and iCloud Drive to keep your photos, videos and documents safely stored in iCloud. And with iCloud Backup, you are keeping all the apps on your devices automatically backed up each night.\nIf you run out of iCloud storage, your new photos, videos and documents will no longer be uploaded to iCloud and your devices will stop being backed up.\nSincerely,\nThe iCloud Team",
        "Category": "Updates"
    },
    {
        "Sender Address": "Carousell",
        "Sender Name": "mail@carousell.com",
        "Subject": "Welcome to Carousell!",
        "Content": "Welcome to Carousell, zaidwu39352!\n\ninsert alt text here\nDid you know that the average user takes just 3 minutes to list an item on Carousell, and that tons of people-powered transactions happen daily?\n\n‘Nuff bragging about ourselves! Now, we want you to experience the delight of selling and buying with people right in your community. Not only do you get a good deal out of another person’s decluttering, but in doing so, we make more possible for one another.\n\nSo what’s your plan right now?",
        "Category": "Updates"
    },
    {
        "Sender Address": "JPMorgan Chase & Co. Human Resources",
        "Sender Name": "eino.fa.sender@workflow.mail.us2.cloud.oracle.com",
        "Subject": "Thank you for your interest in a career with us",
        "Content": "Thank you for your interest in the Infrastructure Engineer I, Application Support position. We regret to tell you that you are no longer being considered. However, we encourage you to continue to visit our careers site to search and apply for other positions that match your skills and interests. We appreciate the time you took to apply and wish you success in finding your next role. Sincerely, JPMorgan Chase Recruiting",
        "Category": "Updates"
    },
    {
        "Sender Address": "OpenAI",
        "Sender Name": "noreply@tm.openai.com",
        "Subject": "OpenAI API Invoice 42ADAF54-0010",
        "Content": "Hi there,\nHere is your invoice 42ADAF54-0010 for $190.38 USD.\nThe invoice has been fully paid with your credit card ending in 1522.\nView Invoice\nThis link expires after 30 days, after which you can view the invoice in your billing history.\nThanks for being part of our API developer community!\nBest,\nThe OpenAI team\nP.S. If you have any questions about this invoice, get in touch with us at ar@openai.com",
        "Category": "Updates"
    },
    {
        "Sender Address": "WeBull",
        "Sender Name": "noreply@webull.com.sg",
        "Subject": "HK Stock Market Closed on Ching Ming Festival",
        "Content": "Hi there!\n \nThe HK Stock Market will be closed for Ching Ming Festival, on Thursday, 4 April 2024 (HKT) \nand will resume on Friday, 5 April 2024 (HKT). \nDuring the closure of the HK Stock Market, you may still proceed to execute trades on the other market, \nand the features within the \nWebull App will continue to remain active.\n \nRegards,\nTeam Webull",
        "Category": "Updates"
    },
    {
        "Sender Address": "Ninja Van SG",
        "Sender Name": "noreply@ninjavan.co",
        "Subject": "Your parcel from Lazada is being delivered to you today!",
        "Content": "Your parcel from Lazada is being delivered to you today!",
        "Category": "Updates"
    },
    {
        "Sender Address": "L'Oréal Careers",
        "Sender Name": "noreply.careers@loreal-group.com",
        "Subject": "Reminder: We would like your consent to keep you in our Talent Pool!",
        "Content": "Hello Qingyang,\n\nThis is a gentle reminder to follow up on our previous email, requesting for your consent to our Privacy Policy to consider your profile for opportunities at L'Oréal.\n\nDo not worry it is a very simple process and will require just a couple of minutes. Simply click the link below if you agree to stay in our talent pool.\n\nI'm interested\n\nWe look forward to exploring your opportunities here at L'Oréal.\nThank you.\n\nKind regards,\nL’Oréal Talent Acquisition Team",
        "Category": "Updates"
    },
    {
        "Sender Address": "ICBC Customer Service",
        "Sender Name": "customer_service@sg.icbc.com.cn",
        "Subject": "Stay vigilant and beware of Scams",
        "Content": "ICBC has noticed a rise in scam recently. Please stay vigilant and protect yourself from potential banking scam threats. Let’s ACT against Scams!\n\nA - Add security features, add ScamShield APP\n\nC - Check with trusted others or official sources\n\nT - Tell authorities, family, peers about scams\n\nBeware of these scams types:\nPhishing scam\nJob scam\nE-commerce scam\nInvestment scam\nFake friend call scam\nCredit-for-sex scam\nInternet scam\nGovernment officials impersonation scam\nSocial media impersonation scam\nHere are some scammers’ method:\nTempting offers\nUnexpected friend requests\nPay by gift cards and credit\nUrgent money transfers\nOTP requests and etc.\nWhat to do avoid being targeted as victim:\nEmbassies and government agencies will not request personal information or request remittances over the phone or online social platforms. If you receive a call from an unknown source, especially a call with the phone number prefix showing \"+65\", you can take the following measures:\n\nHang up the phone and call back according to the caller number after 5 minutes for verification.\nIgnore the call or do not listen to the caller’s instructions for remittance or payment.\nVerify with the embassy or the police immediately (embassy consular protection hotline: 0065-64750165; police hotline: 1800255 0000; anti-fraud helpline: 1800 722 6688).\nMaintain communication with family and friends, do not panic when encounter problems, and listen to the opinions of family and friends.\nIf you are unfortunately defrauded, you should immediately report to the Singapore police and contact the bank where you opened your account to freeze your account, take measures to prevent further loss.\nSource: Singapore Scam Alert, Singapore Police Force and China Embassy in Singapore",
        "Category": "Updates"
    },
    {
        "Sender Address": "Coursera",
        "Sender Name": "no-reply@t.mail.coursera.org",
        "Subject": "Important GTC Update",
        "Content": "GTC platform update\n\n\n\n\nHello to our Global Translator Community!\n\n\n\n\nThank you for your patience and dedication to expanding education access to global learners! I’m writing to let you know about big changes coming up for the GTC.\n\n\n\n\nWe know that GTC Platform is creating a very frustrating experience for you, so it has become clear to us that the platform needs to be completely overhauled.After extensive discussions with our Product team, we have all agreed to close down the GTC platform to avoid even further disruption and challenges for translators.\n\n\n\n\nWe expect to turn off access to the GTC platform on December 1, 2023.\n\n\n\n\nIf you would like to be notified if the platform relaunches in the future, please fill out this form. You will also be able to opt in to being contacted for surveys about the future of the GTC. If you do not have access to Google forms, please review the FAQ for instructions.\n\n\n\n\nWe understand that the translated experience is important to you. In addition to answering a number of practical questions, our FAQ outlines some ways that you can share feedback to improve the experience for learners in your language. I have included them below for those of you without Google access.\n\n\n\n\nOnce again, thank you for your commitment to expanding learner access to education over the last few years.\n\nThank you!\nCoursera Localization\n\n\n\n\nFAQ\n\n\n\n\n1. What is happening with the GTC?\n\nOn December 1, we are shutting down the GTC Platform to begin a much-needed rebuild. Due to the age and technical limitations of the current GTC Platform, we are unable to offer our volunteer community the user experience you deserve. For now we are closing the existing platform and reassessing the future of the GTC.\n\n\n\n\n2. Will I be able to continue translating during the shutdown?\n\nNo - we expect to make the GTC Platform inaccessible on December 1st. If it is still accessible for some reason after that date, we request that you do not continue to translate, since the work will not appear on our courses.\n\n\n\n\n3. Will the GTC relaunch in the future?\n\nWe’re not sure yet. If it does, the earliest we may relaunch is late 2024. If you wish to be notified if the community relaunches, please complete this Google form. This form also allows you to opt in to participate in future feedback requests related to the GTC Platform if you so choose.\n\nIf you do not have access to the Google form, follow these instructions to opt in:\n\n\nSend email to translate@coursera.org with subject line \"Opt In\".\nDue to the volume of emails we receive, using the correct subject line ensures your information will be captured\nIn the body of the email, provide the following information:\nPreferred email address\nTarget language\nOpt in for receiving surveys in the future: Yes or No\n\n\n4. What will happen to the translations I’ve already completed?\n\nPublished subtitles will function as they always have - they will remain visible on the translated video unless a change is made to the original course, or until the institution that owns the course requests we make a change.\n\n\n\n\n5. What will happen to my translations that were not yet published?\n\nAll translations completed by volunteers are saved to our GTC translation memory, TM. This TM will allow us to publish most previously translated strings if we re-launch in a new system in the future.\n\n\n\n\n6. How can I help other learners who speak my language in the meantime?\n\nWe encourage all volunteers to provide feedback when they see translation issues on Coursera courses. There are 3 ways to provide feedback on the quality of Coursera’s translations. This feedback is monitored by Coursera’s Product team to help us make targeted updates to courses with sub-par translations.\n\nUsing the language toggle:\n\n\nVisit the page you want to provide feedback about\nUse the new language dropdown at the top of the page to select your language.\nSelect the line that says “Add translation feedback” in your language.\nUsing the \"Report an Issue\" button:\n\n\nVisit the course and asset - video, reading, quiz, etc. - that you would like to provide feedback about\nScroll down to the bottom of the page and click \"Report an issue\". This will allow you to provide feedback about the course. Be sure to mention which language the feedback applies to since this button is not limited to reporting translation issues.\nIf you are taking a translated course, you can complete the survey that pops up after the first module. This option is limited to machine translated courses, which are indicated by “auto” appearing after the language name.\n\n\nEnroll in a translated course.\nComplete the first module -- this is usually the first week\nThe system will auto-prompt you to complete a survey asking about the effectiveness of the translation.\n\n\n7. Can I still list the GTC badges, certificates, etc. that I received on LinkedIn/my resume, etc.?\n\nYes - Any acknowledgement from Coursera of past engagement as a volunteer is still valid.\n\n\n\n\nHelp  |  Privacy Notice\n\n© 2023 Coursera Inc. All rights reserved. Coursera and the Coursera logo are registered trademarks of Coursera, Inc. All other trademarks are property of their respective owners.\n\nThis email does not contain an unsubscribe link because it contains important account information that we are required to send you. Log in to manage all your notification preferences in Email Settings.\n\nCoursera | 381 E. Evelyn Ave, Mountain View, CA 94041 USA",
        "Category": "Updates"
    },
    {
        "Sender Address": "hailing@tada.global",
        "Sender Name": "hailing@tada.global",
        "Subject": "[TADA] Receipt",
        "Content": "TADA\nReceipt\n\nTotal Fee Charged\nSGD 16.9\nRide Fare\nSGD 15.5\nPlatform Fee (incl. GST)\nSGD 0.6\nDriver's Fee\nSGD 0.5\nPayment Transaction Fee\nSGD 0.3\nPick-up Date and Time\n2024-03-29 11:51 ~ 12:10\nRide Type\nAnyTada\nDriver's Name\nLim Khoon Liang\nPassenger's Name\nAbigail\nBooking Code\ne0b64a16-5e16-4323-b9c2-a80ae5de6fd0\nPick-up Location\nWestgate Taxi Stand 1 07-01 Gateway Dr, Westgate, (S)608531\nDrop-off Location\n60 Trevose Cres 60 Trevose Cres, (S)298090\nPayment Method\nNETS QR\nFacebook        Instagram\nTADA        \nhailing@tada.global\nGST Reg No. 201835970H",
        "Category": "Updates"
    },
    {
        "Sender Address": "Lazard Singapore",
        "Sender Name": "noreply@support.lazada.sg",
        "Subject": "Hey 88426013, your order is confirmed!",
        "Content": "Hi 88426013,\nThank you for ordering from Lazada!\n\nWe’re excited for you to receive your order #117482967960086 soon and will notify you once it’s on its way. If you have ordered from multiple sellers, your items will be delivered in separate packages. We hope you had a great shopping experience! You can check your order status here.",
        "Category": "Updates"
    },
    {
        "Sender Address": "Evernote",
        "Sender Name": "noreply@comms.evernote.com",
        "Subject": "Evernote now syncs with Microsoft Outlook Calendar",
        "Content": "Evernote Calendar just got better—introducing the Microsoft Outlook Calendar integration\nAdd your personal calendar directly to Evernote (we now support Google and Outlook Calendar). Use the Calendar feature to view your schedule at a glance and create event-specific notes with just one click. From there, easily share notes with others stakeholders (even if they don’t use Evernote).\n\nEvernote Calendar is currently available for Personal, Professional, and Teams customers. Want to get the full Calendar experience by connecting multiple accounts?\n\nMore Calendar improvements coming soon!\nThe new Outlook Calendar integration is only the first step. We’re already working on additional ways to increase Calendar functionality and integrate it better with many of Evernote’s other helpful tools. Find out more in our latest blog post.",
        "Category": "Updates"
    },
    {
        "Sender Address": "Ninja Van SG",
        "Sender Name": "noreply@ninjavan.co",
        "Subject": "Ninja Van has successfully delivered your parcel NLSGD37554709",
        "Content": "Your parcel from Lazada has been delivered!\nThank you for shipping with Ninja Van! We look forward to serving you better.\n\nDon't hesitate to let us know if there's anything we can do to make your Ninja experience better.\nHow would you rate our driver?\nAllow us to serve you better by rating and filling up a short survey.",
        "Category": "Updates"
    },
    {
        "Sender Address": "jobs@message.jobscentral.com.sg",
        "Sender Name": "JobsCentral",
        "Subject": "Your Account Will Be Permanently suspended",
        "Content": "\n\nHi ,\n\nWe're reaching out one last time. It appears you haven't reactivated your account, and we're sad to see you go.\n\n \n\nTonight is the deadline, and if you don't reactivate by then:\n\n \n\nYour account will be suspended\nYou will not receive news about new job opportunities\n \n\nDon't miss out on your next opportunity. Click below to reactivate now!\n",
        "Category": "Updates"
    },
    {
        "Sender Address": "Lazard Singapore",
        "Sender Name": "noreply@support.lazada.sg",
        "Subject": "Hey 88426013, your items have been delivered!",
        "Content": "Your order has been delivered!​\nHi 88426013,\nWe are pleased to inform that your order #119192562560086 has been delivered.\n\nWe hope you are enjoying your recent purchase! Once you have a chance, we would love to hear your shopping experience to keep us constantly improving.",
        "Category": "Updates"
    },
    {
        "Sender Address": "Dow Jones",
        "Sender Name": "support@t.dowjones.com",
        "Subject": "Update to Terms of Use",
        "Content": "Dear Reader:\n\nWe are writing to let you know that as of March 18th, 2024, we have updated our Terms of Use, formally known as the Subscriber Agreement and Terms of Use. These updates apply to the following Dow Jones products and services: The Wall Street Journal, Barron’s and MarketWatch.\n\nBelow is a summary of some of the key changes:Made our Terms of Use easier to understand, including providing more clarity regarding our subscription practices and policies;\nAdded information regarding our products and services, including our bundled services;\nRevised our arbitration clause, which covers any disputes relating to our Terms of Use and your relationship with us.\nWe encourage you to review the updated Terms of Use. By continuing to use our products and services, you agree to our updated Terms of Use. The updated Terms of Use will be available to you anytime you need it through the links on our home page and each respective product page.\n\nNote: This is a legal notice, which is why you are receiving it even if you have opted out of Dow Jones marketing and promotional emails.",
        "Category": "Updates"
    },
    {
        "Sender Address": "KFC Singapore",
        "Sender Name": "no_reply@kfc.com.sg",
        "Subject": "KFC Takeaway Order Confirmation",
        "Content": "Hi ryu,\n\nThank you for ordering! Please approach the Manager-on-duty for collection.\n\n\n\nYOUR ORDER : 9558\nCOLLECTION DATE : 25 Mar 2024\nESTIMATED COLLECTION TIME : 09:40 PM\nRESTAURANT ADDRESS : Vista Exchange Green, The Star Vista, #B1-13 Singa 138617\nSTORE : Star Vista\nSTORE NUMBER :\nPAYMENT METHOD : DBS PayLah\nCUSTOMER CONTACT NUMBER : 81276732\n1X BBQ CHEESE ZINGER MEAL\t$ 9.20\n1x BBQ Cheese Zinger\t\n1x Fries Medium\t\n1x Coke Zero Regular\t\n1X 6PCS EGG TARTS\t$ 10.00\nCONTACTLESS TAKEAWAY\nCUTLERY: NOT NEEDED\n\nSUBTOTAL :\t$ 19.20\nGST INCLUDED(9%) :\t$1.59\nTOTAL :\t$ 19.20\nSincerely,\n\nKFC Singapore",
        "Category": "Updates"
    },
    {
        "Sender Address": "Revolut",
        "Sender Name": "no-reply@revolut.com",
        "Subject": "You sent $110.68 to Wei Cheng Ng",
        "Content": "Hi Wei Cheng, You sent $110.68 to Wei Cheng Ng. You can find the details below: To Wei Cheng Ng Sent $110.68 Reference Sent from Revolut On Sunday, 24 March, 15:40 Expected arrival Today If you don't recognise this transfer, please contact us immediately. Our Support team is available 24/7 via the in-app chat. — Team Revolut Your transfer receipt is attached to this email.",
        "Category": "Updates"
    },
    {
        "Sender Address": "giga!",
        "Sender Name": "fyi@giga.com.sg",
        "Subject": "You have received gigaBucks for your giga line!",
        "Content": "You have received gigaBucks for your giga line!\t \n \tHi hi!\t \nYou have received $22 gigaBucks for your giga mobile number 88306386. gigaBucks are credits stored in your gigaWallet that you can use to offset your monthly giga bills and/or to purchase extras or optional giga Services.\t \nNote that gigaBucks are valid for 3 months from today’s date. Simply login to your giga app, and click on the “g” wallet on the top right corner of your dashboard to view your available gigaBucks today!",
        "Category": "Updates"
    },
    {
        "Sender Address": "Ninja Van SG",
        "Sender Name": "noreply@ninjavan.co",
        "Subject": "Ninja Van has picked up your parcel NLSGD37554709",
        "Content": "Your parcel from Lazada has been picked up by Ninja Van!",
        "Category": "Updates"
    },
    {
        "Sender Address": "Li Yu Tan",
        "Sender Name": "tanliyu@lcsfc.sg",
        "Subject": "[CONFIRMATION] Team Nila Activation for LCS vs Jeonbuk (8 Nov, Wed)",
        "Content": "Dear all Team Nila Volunteers,\n\nThank you for volunteering to be part of the Team Nila Cheerleading Squad at the upcoming Asian Champions League Match between Lion City Sailors FC and Jeonbuk Hyundai Motors FC. Your participation is confirmed and details for the game are as follows:\n\nVenue: Jalan Besar Stadium\nDate: 8 Nov (Wed)\nReporting Time: 5pm (ticket collection starts from 4.30pm)\nAttire: Team Nila Purple Top (or any white tops)\n\nPlease join the telegram channel below as we will provide updates and further information via the telegram channel:\n\nhttps://t.me/+9QGTg3KXxRI2OWU1\n\nWe have also prepared some common chants / songs that the LCS fans will be singing during the game and you can find them via the link below:\n\nhttps://youtu.be/WVzoENwx0hA\n\nFinally, attached in this email is the detailed admin instructions for the match. Please refer to it for information on ticket collection.\n\nThank you very much and we look forward to singing and chanting with all of you!\n\nRegards,\nLi Yu",
        "Category": "Updates"
    },
    {
        "Sender Address": "Apple",
        "Sender Name": "appleworldwiderecruiting@email.apple.com",
        "Subject": "Thanks for your interest in Apple.",
        "Content": "We just received your CV for the following role: Apple Services Engineering - Content Support Engineer 200535866. Thanks for thinking of us. Here’s what happens next: If you’re a potential match for the role, you’ll hear from one of our recruiters. We’ll also keep your CV on file if another job matches your experience. Apple is a place where people from all backgrounds come together to do the best work of their lives. And we’re always looking for great people to join us. Regards, Apple Worldwide Recruiting",
        "Category": "Updates"
    },
    {
        "Sender Address": "noreply@npn.sg",
        "Sender Name": "\nNPN System",
        "Subject": "Retrieve your NPN Product here",
        "Content": "Thank You For Purchase!\nHello Long Ji-An,\nWe are delighted that you have found something you like! Do you know what's more amazing? if you could leave us a review under your purchases. Your reviews help us improve our products and help other customer make choices.",
        "Category": "Updates"
    },
    {
        "Sender Address": "Ticketmaster Singapore\n ",
        "Sender Name": "no-reply@campaign-mail-1.com",
        "Subject": "Thanks for registering for Taylor Swift | The Eras Tour\n",
        "Content": "Thanks! We Got Your Registration.\nWe expect there will be more demand than there are tickets available. Please note, receiving a purchase link and code does not guarantee you tickets. Ticket availability is limited. Tickets will be sold on a first come, first served basis while currently-available inventory lasts.\n\nYou’ll receive an email on 5th July 2023 confirming next steps.\n\nBack to taylorswift.com/tour",
        "Category": "Updates"
    },
    {
        "Sender Address": "notifications@instructure.com",
        "Sender Name": "CFG1003 Financial Wellbeing-Introduction [2320]",
        "Subject": "No title: CFG1003 Financial Wellbeing-Introduction [2320]",
        "Content": "Dear Students,\n\nAs we approach the deadline for completion of CFG1003 on 12th April,  a reminder on the  passing criteria:\n\nAs a 0 Unit course there are no assignments, but you are required to complete all chapters of the e-learning lesson 'Financial Wellbeing - Introduction' in order to pass the course. The bonus chapter 'Introduction to CPF and Insurance' is not compulsory but we advise you to complete it for your own benefit.\n\nIf you are enrolled in CFG1004 this semester, note that as CFG1003 is a co-requisite so you must also satisfactorily complete CFG1003 in order to pass CFG1004.\n\nYou can verify your completion of the e-learning by going to Grades where your completion status will be indicated:\n\nYour completion  of the e-learning lesson 'Financial Wellbeing - Introduction' should be indicated with a tick mark as soon as you complete the session, however if you complete the course on a mobile device or tablet, Canvas may not capture your completion. Please refer to the picture for reference\n \n\nIf you do not see a tick mark and have completed the e-learning, you must also take a screenshot of the final screen of the e-learning 'Financial Wellbeing - Introduction' and upload it to the respective assignment folder\nPlease email cfg_financialwb@nus.edu.sg if you have any queries\nThe final deadline for the completion of the e-learning is 12 Apr (Fri), 23:59\n\nReplies to this email will be posted as a reply to the announcement, which will be seen by everyone in the course.\n\n\nView announcement  |  Update your notification settings",
        "Category": "Updates"
    },
    {
        "Sender Address": "googleaistudio-noreply@google.com",
        "Sender Name": "Google AI Studio",
        "Subject": "Welcome to Google AI Studio",
        "Content": "Welcome to\nGoogle AI Studio\nGoogle AI Studio is the fastest way to explore the capabilities of Gemini, our family of next generation multimodal models. Experiment by crafting prompts with text and image inputs to generate text responses with the Gemini API.\n\t\nCreate, test, and save prompts\nProvide context and examples to guide the model response. Select models and adjust parameters in the run settings.\n\t\nCustomize models in minutes\nTune a model with example data to enhance performance for specific tasks and reduce the amount of instruction needed for new prompts.\n\t\nBuild applications with the API\nIntegrate prompts into apps by grabbing your API key and exporting as code into your project.\n\n\t\nGet started\nExplore the developer docs\nGoogle AI Studio quickstart\t\nLearn how to craft different prompts with end-to-end-examples.\nIntroduction to prompt design\t\nNew to prompting? Learn how structuring prompts can improve the model’s response.\nAPI overview\t\nReference documentation for Gemini models to build chat applications, embeddings, and more.\nDon't know where to start?\nStart with examples and get inspired to build something amazing.\nGet support and stay connected on the #gemini-api channel on the Google Developer Community Discord server.",
        "Category": "Updates"
    },
    {
        "Sender Address": "campusrecruitmentasia",
        "Sender Name": "campusrecruitmentasia@barclays.com\n",
        "Subject": "Updates on your Barclays application",
        "Content": "Thank you for your application to Quantitative Analytics Analyst/Associate Off Cycle Internship 2024 Singapore.\n\n \n\nWe are writing to inform you that we will not be moving forward with your application at the current time.   \n\n \n\nWe encourage you to visit our website https://search.jobs.barclays/ explore other opportunities that may interest you as well as interview tips.\n\n \n\nAgain, we appreciate the time you have invested in your application and your interest in Barclays.\n\n \n\n \n\nBest regards,\n\n \n\nBarclays Campus Recruitment,\n\n \n\nAPAC",
        "Category": "Updates"
    },
    {
        "Sender Address": "Duolingo",
        "Sender Name": "hello@duolingo.com",
        "Subject": "Hi zaid! Keep your 99 day Spanish streak going!",
        "Content": "How do you say “on a roll” in Spanish?\nWay to commit to learning Spanish! Make it to a 100 day streak with a quick lesson now.",
        "Category": "Updates"
    },
    {
        "Sender Address": "notifications@discord.com",
        "Sender Name": "Discord",
        "Subject": "Updates to Discord’s Policies",
        "Content": "\nHey!\n\nWe wanted to let you know that we’re updating our Terms of Service, Privacy Policy, Paid Services Terms, and Community Guidelines. We periodically make these updates as our business evolves or to respond to new laws.\n\nThese changes will take effect on April 15, 2024.\n\nHere are some highlights of what we’ve updated:\n\nHow we describe our services: Made it easier to understand how Discord works, the features we offer, and how our services can be personalized for you.\nHow we resolve disputes: Updated our informal dispute resolution process and our arbitration agreement. We work hard to make sure you always love Discord and hope there’s never a dispute!\nHow we approach privacy: Provided more information about privacy rights and how they are exercised. We also updated what data we collect and how we use it. Your privacy is important to us, and we try to limit what information we collect and give you control over your privacy on Discord.\nHow we explain our Community Guidelines: Added more context and made our guidelines easier to understand.\nWe encourage you to read the updated documents in full. We’ve also summarised important changes on our blog.\n\nThanks for helping us make Discord the best place for people to hang out and talk together!\n\nDiscord",
        "Category": "Updates"
    },
    {
        "Sender Address": "noreply@shaw.sg",
        "Sender Name": "Shaw Theatres PTE LTD",
        "Subject": "Movies Purchase Confirmation",
        "Content": "\nHi Long Ji-An,\nThank you for your purchase!\nFor movie tickets purchase only, you may use this QR code to enter directly at the usher point.\nFor movie tickets with F&B purchases, you will need to print your collection slips at the counters or kiosks to collect your items and enter into the hall.",
        "Category": "Updates"
    },
    {
        "Sender Address": "Estée Lauder UK",
        "Sender Name": "news@em.esteelauder.co.uk",
        "Subject": "Our focus group is now full, Celia",
        "Content": "Our foundation focus group is now full. Keep your eyes peeled for our next opportunity.\n\nDue to unprecedented demand, our focus group is now full.\n\nThank you for your interest and we apologise for any disappointment.\nKeep an eye on your inbox for our next focus group opportunity.\n\n\nIf you have any questions or would like more information, just contact our customer care team below.\n",
        "Category": "Updates"
    },
    {
        "Sender Address": "LumiHealth",
        "Sender Name": "noreply@lumihealth.sg\n",
        "Subject": "You’ve been withdrawn from LumiHealth\n",
        "Content": "You’ve been withdrawn from LumiHealth\n\nDear Ryu,\n\nThe earlier LumiHealth experience has ended; your account has been withdrawn from LumiHealth, and no further data about you will be collected.\n\nWe'll store the personal information you've already shared with us as outlined in the programme participant agreement.\n\nThere is no further action required from you. To keep participating, please download the latest LumiHealth app from the App Store.\n\nShould you have any clarifications or require further assistance, you can email us at HPB_Mailbox@hpb.gov.sg or call us at 1800 223 1313 during our operating hours from 8 am to 6 pm, Mondays to Fridays (excluding Public Holidays).\n\nBest regards\nTeam LumiHealth",
        "Category": "Updates"
    },
    {
        "Sender Address": "DoNotReply@mcdonalds.com",
        "Sender Name": "McDonald's Account Services",
        "Subject": "My McDonald's App - Mobile Order - Payment Received",
        "Content": "This is not a receipt, you will receive physical receipt after you collect your food\n\nDear abigail,\nThanks for choosing McDonald's!\n\nDate:\n20/01/24 \nRestaurant Name:\nMcDonald's Alocassia\nOrder Id:\n123\nAmount:\n1.60 SGD\nCard:\nVisa / ****************\nTerms and Conditions\n\n\n \nM        F        Y        \nA little hungry?\n\n \n         \n© 2023 Hanbaobao Pte. Ltd. (Licensee of McDonald's)\nContact us   •   Privacy Policy\n\nHanbaobao Pte. Ltd. (Licensee of McDonald’s),\n10 Kallang Avenue, #04-10\nTower 2 Aperia,\nSingapore 339510",
        "Category": "Updates"
    },
    {
        "Sender Address": "Gradescope",
        "Sender Name": "no-reply@gradescope.com",
        "Subject": "\n[MAST30022_2022_SM2 on Gradescope] Successfully submitted to Exam_MAST_30022_2022_S2",
        "Content": "Hello Qingyang Wu,\n\nYour submission for Exam_MAST_30022_2022_S2 in MAST30022_2022_SM2, Winter 2022 was uploaded successfully. You can submit any number of times until the due date, Nov 17, 2022 at 3:15:00 PM AEDT. Once graded, click a question to view the grading rubric and optionally submit a regrade request (if your instructor has enabled it).\n\nSubmitted At:\nNov 17, 2022 at 2:52:07 PM AEDT\n\nDue Date:\nNov 17, 2022 at 3:15:00 PM AEDT\n\nLink to submission:\nhttps://www.gradescope.com/courses/415782/assignments/2439545/submissions/149399169\n\n- The Gradescope Team",
        "Category": "Updates"
    },
    {
        "Sender Address": "\nKickoffsg No-reply",
        "Sender Name": "no-reply@kickoffsg.com",
        "Subject": "Booking Confirmation\n",
        "Content": "Your Booking\nBK6986\tKick Off Pte Ltd\nHello Ryu Suzuki,\n\nThank you for booking .!\n\nYour Booking Details\n\nGround : KickOff Ground\n\nDate : 28/12/2023\n\nTotal Charges : S$ 70.00\n\nPitch\tTime Slot\nPitch 3\t3 pm - 4 pm\nPitch 3\t4 pm - 5 pm\n\n\nAlways here,\nKICKOFF Team",
        "Category": "Updates"
    },
    {
        "Sender Address": "NUS JSS",
        "Sender Name": "contact@jss.sg",
        "Subject": "April 2024 BnS Signups",
        "Content": "Hi JSS members!\n\nWe hope that everyone is doing well this semester! \n\n\n\nAs a new month approaches, we're excited to announce the upcoming BnS exchanges we have lined up below! \n\n\n\nExchanges are open to all NUS JSS current members and alumni!\nhttps://nus.campuslabs.com/engage/submitter/form/start/629934\nTo sign up for the exchange, please fill-up the form via the link below:\n\n\n\n*Please DO NOT submit multiple forms. Do check your schedule thoroughly before you begin the form. Do also note the updated things to take note below.\n** if you have submitted this form previously, there is NO NEED to submit the form again unless you are selecting new exchanges. \n\nPlease submit your completed form by 17 March 2024, 1200 (Sunday). The form will be closed and we will not entertain any late submissions.\n\nPlease make sure that you are able to commit for the entire duration of each session before handing up the form. \n\n\n\nPlease email nusbns@jss.sg if you have any questions.\n\nExchange Details:\n\n\n\n1. ISA Tokyo FIT\n\nDate: 3 April 2024 (Wednesday)\n\nTime: 1400 - 1700 (3hrs)\n\nMedium: PHYSICAL Session\n\n\n\n\n\nPlease take note of the following when signing up for exchange(s): \n\nPlease ensure that your contact details and bank account number are stated correctly. If you provide the wrong bank account number, you will have to forfeit 10% of the full amount due to bank administrative charges.\n\nPlease only sign up for the exchanges that you can go for, and ensure that you keep those days free. Kindly notify us ASAP when you realise that you are no longer able to participate in an exchange after signing up. If you wish to withdraw from an exchange that you have confirmed your attendance for, you are expected to find someone to replace you. \n\nIf you do not reply to our confirmation emails within 3 days and withdraw from an exchange, you are also expected to find someone to replace you.\n\nPlease note that you are required to be present for the entire duration of the exchange. You are not allowed to join or leave halfway through. \n\nFor online sessions, the Zoom link will be provided closer to the exchange date, please keep a lookout for the updated information via email.\n\n \nIf you do not receive any email from us, it means that you have not been selected. (Confirmation emails will usually be sent out 1-2 weeks before the exchange date, or earlier). If that is the case, please sign up for other exchanges the next time around.\n \nWe look forward to your active participation, as this is a good opportunity to interact with Japanese students and to improve your Japanese language skills.\n\nBest regards,\nShaw Fong and Zheng Jun \nBnS Coordinators\n41st Japanese Studies Society\nNational University of Singapore",
        "Category": "Updates"
    },
    {
        "Sender Address": "eVISA",
        "Sender Name": "no-reply@evisa.mofa.go.jp",
        "Subject": "APAN eVISA [Notification of cancellation of visa application processing]",
        "Content": "JAPAN eVISA [Notification of cancellation of visa application processing]\n\nThank you for using JAPAN eVISA.\n\nThe visa application processing for the receipt number 1000001314154 has been cancelled.\nThere might have been an insufficiency in the items you uploaded (e.g. facial image, passport photo, documents and information which you have filled in), or your travel purpose was not eligible for submission through the eVISA system.\nPlease check the contents of your application and try again.\nFor applications other than the purpose of Tourism  (such as for Business, Domestic Helper), please submit your documents physically at the Embassy.\n\nYou may refer to the following website for checklists of required documents and sample templates:\nhttps://www.sg.emb-japan.go.jp/itpr_en/visa_documents.html\n\nContact details: \n  Embassy of Japan in Singapore\n　Address: 16 Nassim Road, Singapore, 258390, Republic of Singapore\n　Website: https://www.sg.emb-japan.go.jp/itpr_en/visit.html\n　E-mail: fastlane@sn.mofa.go.jp\n　TEL number: (65)6235-8855",
        "Category": "Updates"
    },
    {
        "Sender Address": "DBS Careers",
        "Sender Name": "no-reply@icareer.sin.auto.prod.pc0.dbs.com",
        "Subject": "Invitation to complete the 2024 DBS Analytics Capability Enhancement (ACE) Programme (ID: 2400000E) application",
        "Content": "Invitation to apply for 2024 DBS Analytics Capability Enhancement (ACE) Programme (ID: 2400000E) - 2400000E Apply for job with Jim Thank you for your interest in 2024 DBS Analytics Capability Enhancement (ACE) Programme (ID: 2400000E) - 2400000E. We would like to invite you to complete an online application with Jim. Before you begin, please note the following: The application will take approximately 30 minutes to complete. Complete the application in a quiet place, free from interruption and preferably within 24 hours. If you are unable to complete it within one session, you can always return to Jim using the link below to resume the application. Please refrain from deleting this email, as you can only access the chatbot using the link. Use a desktop or laptop computer using the following browser: Google Chrome, Safari, Microsoft Edge or Firefox.",
        "Category": "Updates"
    },
    {
        "Sender Address": "noreply@email.meta.com",
        "Sender Name": "AI at Meta",
        "Subject": "Resubmit your request for access to Llama models",
        "Content": "We hope this email finds you well. We have made some improvements to the download process for Llama models on Hugging Face based on user feedback. We noticed that your request for access to the Llama models was not completed and wanted to reach out to you.\n\nTo resubmit your request, please follow these simple steps:\n\nVisit the Hugging Face website https://huggingface.co/meta-llama.\nLogin to your Hugging Face account and click \"submit\"\nFill out the form and agree to the Llama 2 License and Acceptable Use Policy\nSubmit the form.\nOnce submitted your request will be processed and an email notification will be sent to the email used to register.\n\nThank you for choosing Llama, we look forward to seeing the exciting things you will build with it.\n\nMeta GenAI Team",
        "Category": "Updates"
    },
    {
        "Sender Address": "noreply-travel@google.com",
        "Sender Name": "Google Flights",
        "Subject": "Your tracked route: Singapore to Phuket flights from SGD 139",
        "Content": "Hello,\nWe've found some great prices for one-week trips in February, from Singapore to Phuket.\n\n1-week trips in February\n6–9 days · Round trip · 1 adult · Economy\nFri, 16 Feb – Thu, 22 Feb\nSAVE 34%From SGD 139\nView\n\tJetstar · Non-stop · SIN–HKT · 3 hrs\n \nSat, 24 Feb – Fri, 1 Mar\nSAVE 30%From SGD 148\nView\n\tJetstar · Non-stop · SIN–HKT · 2 hrs\n \nThu, 29 Feb – Wed, 6 Mar\nSAVE 27%From SGD 153\nView\n\tJetstar · Non-stop · SIN–HKT · 2 hrs\n \nPrices are currently low for February\nSGD 139 is low\n \t\n \n \n \t \n \n \t \n \t \n \n \t \n \t \n \n \tSGD 155\t \tSGD 310\t \nPrices are cheaper than usual. The least expensive flights for similar trips to Phuket usually cost between SGD 155–310. Anything less is considered a deal.\nView more flights\n \nDid you find this email useful?\t\nthumbs up\nthumbs down\n \nAll savings and insights are based on fares observed in the last 12 months for trips in the same season, of similar length, with the same origin and destination, number of stops, class and airline.\nPrices updated 19 January 2024 at 15:09 GMT\nYou have received this email because you signed up to receive travel tips and price updates from Google Flights.\nManage price tracking\nUnsubscribe\n\n\nGoogle LLC\n1600 Amphitheatre Parkway,\nMountain View, CA 94043",
        "Category": "Updates"
    },
    {
        "Sender Address": "regcomms@nus.edu.sg",
        "Sender Name": "University Registrar’s Communications ",
        "Subject": "[NUS RESTRICTED] Changes to Course Registration from AY2024/2025",
        "Content": "COURSEREG UPDATES\nfrom AY2024/2025\nSEMESTER 1 & SEMESTER 2 ONLY\nWhat's Happening? From AY2024/2025 Semester 1 onwards, there will be\nsome changes to CourseReg Exercise:\n• Removal of Round O and an earlier Round 1\n• Standardization of duration of each round\nWhy? We have received feedback that the current CourseReg\nduration is too lengthy.\nThe Changes\n• Removal of Round O and an earlier Round 1\n• Standardization of duration of each round\n• 3 Rounds of Course Selection • Release of Results from Course Selection Round 3 before start of each\nsemester • Each Round of Course Selection will start at 9am and end at 12pm the\nfollowing day. • Each Round of Tutorial/Lab Selection will start at 9am and 5pm on the\nsame day.\nBenefits\n• Completion of Course Selection within a shorter period of time\n• More certainty in courses enrolled at the start of the semester\n• More time for students to make adjustments to the timetable\nFor queries, email coursereg@nus.edu.sg",
        "Category": "Updates"
    },
    {
        "Sender Address": "HomeTeamNS Membership Admin\n ",
        "Sender Name": "membership_admin@hometeamns.sg\n",
        "Subject": "Your HomeTeamNS Membership Renewal is Successful!",
        "Content": "Dear RYU KAIRIN ANAQI SUZUKI,\n\nThank you for your continuous support!\n\nAttached is the official receipt of your Membership Renewal.\n\nWe've gone digital! Simply download and login to HomeTeamNS mobile app here to get your Digital Membership Card* today. You can enjoy endless perks, exclusive deals and stay updated with HomeTeamNS latest news on our app!\n\nFor HomeTeamNS-POSB-PAssion Cardholders^, you may continue using your current Membership Card. A new card will be issued to you by POSB one month before your card's expiry should your membership still be valid then.\n\nEnsure your contact details are also updated by logging in to the members' portal^* and updating your profile. Don't miss out the exciting privileges and happenings we have to offer! We recommend opting in for all communication channels.\n\nFor non-promotional Ordinary and Associate Membership Renewals*^, kindly refer to our website here for more details with regards to your Complimentary Membership Gift.\n\nFind out more about what's happening at www.hometeamns.sg or email us at membership@hometeamns.sg should you have any enquiries.\n\nLet us know what you think: https://onehome.typeform.com/to/daOORZbj\n\n*You will be entitled to a physical HomeTeamNS-PAssion Card only if you have signed up or renewed for a Membership Term of 5 or 10 Years. Should you wish to receive a physical HomeTeamNS-PAssion Card, you may email to membership@hometeamns.sg to request for it.\n^Only Ordinary and Associate Members are eligible to convert to the HomeTeamNS-POSB-PAssion Card. Family Members not eligible.\n^*Membership Portal is accessible by Ordinary/Associate members only. Family Members not eligible.\n*^Non-promotional Ordinary and Associate Membership renewals refers to the default fees shown here. Gift redemptions are not applicable for any Family Membership renewals.\n\n\nAdmin\nHomeTeamNS",
        "Category": "Updates"
    },
    {
        "Sender Address": "BlueSG",
        "Sender Name": "bluesg@blue-solutions.com",
        "Subject": "Subscription Waiver: Revitalizing Your BlueSG Experience\n",
        "Content": "Dear BlueSG user,\n\nWe want to express our sincere gratitude for your on-going trust and support, even amid the recent challenging circumstances.  We know we have fallen short of your expectations, which we deeply regret and are committed to making things right.\n\nUnderstanding the upset and inconvenience that this disruption has caused you, it is important for us to express our apologies to you through more than just words.  As such, we will be extending a subscription waiver for all users in the month of January 2024, covering billing cycle from 1st to 31st January, as a small token of our appreciation for your patience and ongoing loyalty. In addition, we are also looking into further compensating those who have been severely affected by this disruption, together with our Premium Subscribers.\n\nPlease also be assured that our teams have deployed fixes to improve the current situation and to restore your user experience.\n\nThank you for being such an integral part of the BlueSG community, your patience, support loyalty and feedback are the driving forces behind our commitment to continuous improvement.\n\nRegards,\nBlueSG",
        "Category": "Updates"
    },
    {
        "Sender Address": "DBS",
        "Sender Name": "DBSAlert@dbs.com",
        "Subject": "DBS Alert",
        "Content": "Dear Sir / Madam You have set-up a GIRO arrangement for REVOLUT TECH SG P L with bill ref no. ending with 1444 on 19 Mar 2024, 10:19. If this application was not made by you, please contact our Customer Service Hotline. Thank you for banking with us. Please do not reply to this email.",
        "Category": "Updates"
    },
    {
        "Sender Address": "changirewards@info.changiairport.com",
        "Sender Name": "Changi Rewards",
        "Subject": "Hi Jian, Your Rewards Just Got Upgraded! Find Out How",
        "Content": "Hi Jian,\nThank you for being our valued member.\nWe've heard your feedback and we're thrilled to announce some exciting changes to make our Rewards programme a more rewarding one for you!\nStarting 1st April 2024, Changi Rewards points will be valid for a period of 12 months from the time you earned the points. With 12 months validity, fret not about having to redeem your Changi Rewards points by 30 June. Enjoy greater flexibility and accumulate your points for more rewards!\nThat’s not all, stay tuned for even more exciting and meaningful rewards coming your way soon.\nSincerely,\nThe Changi Rewards team",
        "Category": "Updates"
    },
    {
        "Sender Address": "Ocean Restaurant Resorts World Sentosa",
        "Sender Name": "ocean@rwsentosa.com",
        "Subject": "Reservation Updated at Ocean Restaurant Resorts World Sentosa on April 5, 2024, 7:30 pm",
        "Content": "Dear Miss Celia Wu,\n\nYour reservation details have been successfully UPDATED.\nWe look forward to welcoming you and your guests at Ocean Restaurant.\n\nPlease take note that we cater only to children 8 years old and above and we do not provide children menus. Children will dine from the regular set menu at full price and should abide with our dress code policy.\nWe ask for all guests not to wear shorts, bermudas, slippers, sandals and no sleeveless for men.\n\nPlease be advised that we are exclusively offering a set menu for lunch and dinner. Kindly review our menus by clicking on this provided link: https://www.rwsentosa.com/en/restaurants/signature-restaurants/ocean-restaurant Menus and prices are subject to change without prior notice.\n\nIn addition, please note that with the exception of Executive Pastry Chef Kenny Kong\"s cakes, we do not allow the bringing in of cakes purchased from outside. Please note that we do not provide complimentary cakes. To place an order, we ask that you please browse our cake flavors via the following link: https://www.rwsentosa.com/en/promotions/restaurants/rws-patisserie and contact us at +65 6577 6688 with a notice of at least 2-3 days in advance.\n\nSpecial requests are not guaranteed and table allocation is subject to availability and restaurant discretion.\n\nEnjoy FREE PARKING with a minimum SGD20 spend in a single receipt.\n\nYour reservation will be held for 15 minutes only; after which, the restaurant has the discretion to release the reservation.\n\nSee you soon,\nOcean Restaurant, Resorts World Sentosa.",
        "Category": "Updates"
    },
    {
        "Sender Address": "apac.earlycareers@db.com",
        "Sender Name": "APAC Earlycareers",
        "Subject": "Thank you for attending Deutsche Bank - 2024 NTU Welfare Drive",
        "Content": "Dear all,\n\nThank you very much for attending and registering with us at the Deutsche Bank career event conducted at your campus recently.\n\nPleased to share that we have just opened several new opportunities!\n\nPlease refer to the below list for the available opportunities and click on the link respectively to make an application.\n\nNew Opportunities\n\nFor Pre-Penultimate Year Students (i.e. graduating by July 2026):\n\nDB Academy\nThis is a 3-day in-person event at the Deutsche Bank SG office, taking place from 14th May 2024 to 16th May 2024. Come join us to gain deeper insights into banking and Deutsche Bank, as well as meet with various colleagues and learn from our recruiters on how you can stand out as a candidate. This is a highly interactive event giving you access to our senior managers, and we’re looking for talented and driven students to bring their unique perspective to our diverse teams.\n\nOther Available Opportunities\n\nFor Graduating Students (i.e. graduating by July 2024):\n\n2024 Human Resources Graduate Programme - Singapore\nFor Penultimate Year Students (i.e. graduating by July 2025):\n\n2024 Human Resources Summer Internship Programme - Singapore\nFor Pre-Penultimate Year Students (i.e. graduating by July 2026):\n\nCorporate Bank STEM Internship (Off Cycle - Aug-Dec 2024)\nWe look forward to meeting you again soon.\n\nBest Regards,\nDeutsche Bank Early Careers Team\n\n \n\n \n\n\n\n---\nDie Europäische Kommission hat unter http://ec.europa.eu/consumers/odr/ eine Europäische Online-Streitbeilegungsplattform (OS-Plattform) errichtet. Verbraucher können die OS-Plattform für die außergerichtliche Beilegung von Streitigkeiten aus Online-Verträgen mit in der EU niedergelassenen Unternehmen nutzen.\n\nInformationen (einschließlich Pflichtangaben) zu einzelnen, innerhalb der EU tätigen Gesellschaften und Zweigniederlassungen des Konzerns Deutsche Bank finden Sie unter https://www.deutsche-bank.de/Pflichtangaben. Diese E-Mail enthält vertrauliche und/ oder rechtlich geschützte Informationen. Wenn Sie nicht der richtige Adressat sind oder diese E-Mail irrtümlich erhalten haben, informieren Sie bitte sofort den Absender und vernichten Sie diese E-Mail. Das unerlaubte Kopieren sowie die unbefugte Weitergabe dieser E-Mail ist nicht gestattet.\n\nThe European Commission has established a European online dispute resolution platform (OS platform) under http://ec.europa.eu/consumers/odr/. Consumers may use the OS platform to resolve disputes arising from online contracts with providers established in the EU.\n\nPlease refer to https://www.db.com/disclosures for information (including mandatory corporate particulars) on selected Deutsche Bank branches and group companies registered or incorporated in the European Union. This e-mail may contain confidential and/or privileged information. If you are not the intended recipient (or have received this e-mail in error) please notify the sender immediately and delete this e-mail. Any unauthorized copying, disclosure or distribution of the material in this e-mail is strictly forbidden.",
        "Category": "Updates"
    }
]